xrun(64): 22.09-s013: (c) Copyright 1995-2023 Cadence Design Systems, Inc.
TOOL:	xrun(64)	22.09-s013: Started on Dec 16, 2024 at 11:11:44 -03
xrun
	-64bit
	clock_divider_tb.sv
	clock_divider.sv
	+access+rw
	+gui
file: clock_divider_tb.sv
	module worklib.CLOCK_DIVIDER_TB:sv
		errors: 0, warnings: 0
file: clock_divider.sv
	module worklib.CLOCK_DIVIDER:sv
		errors: 0, warnings: 0
		Caching library 'worklib' ....... Done
	Elaborating the design hierarchy:
	Top level design units:
		CLOCK_DIVIDER_TB
xmelab: *W,DSEMEL: This SystemVerilog design will be simulated as per IEEE 1800-2009 SystemVerilog simulation semantics. Use -disable_sem2009 option for turning off SV 2009 simulation semantics.
	Building instance overlay tables: .................... Done
	Generating native compiled code:
		worklib.CLOCK_DIVIDER:sv <0x508d0ebb>
			streams:   4, words:  1146
		worklib.CLOCK_DIVIDER_TB:sv <0x2ad6cb07>
			streams:   5, words:  4599
	Building instance specific data structures.
	Loading native compiled code:     .................... Done
	Design hierarchy summary:
		                 Instances  Unique
		Modules:                 2       2
		Registers:               7       7
		Scalar wires:            4       -
		Always blocks:           1       1
		Initial blocks:          3       3
		Pseudo assignments:      3       3
		Simulation timescale:  1ns
	Writing initial simulation snapshot: worklib.CLOCK_DIVIDER_TB:sv
xmsim: *W,NOMTDGUI: Multi-Threaded Dumping is disabled for interactive debug mode.
xmsim: *W,DSEM2009: This SystemVerilog design is simulated as per IEEE 1800-2009 SystemVerilog simulation semantics. Use -disable_sem2009 option for turning off SV 2009 simulation semantics.

-------------------------------------
Relinquished control to SimVision...
xcelium> 
xcelium> source /home/tools/cadence/installs/XCELIUM2209/tools/xcelium/files/xmsimrc
xcelium> input .simvision/45966_cinovador__autosave.tcl
xcelium> 
xcelium> # XM-Sim Command File
xcelium> # TOOL:	xmsim(64)	22.09-s013
xcelium> #
xcelium> 
xcelium> set tcl_prompt1 {puts -nonewline "xcelium> "}
puts -nonewline "xcelium> "
xcelium> set tcl_prompt2 {puts -nonewline "> "}
puts -nonewline "> "
xcelium> set vlog_format %h
%h
xcelium> set vhdl_format %v
%v
xcelium> set real_precision 6
6
xcelium> set display_unit auto
auto
xcelium> set time_unit module
module
xcelium> set heap_garbage_size -200
-200
xcelium> set heap_garbage_time 0
0
xcelium> set assert_report_level note
note
xcelium> set assert_stop_level error
error
xcelium> set autoscope yes
yes
xcelium> set assert_1164_warnings yes
yes
xcelium> set pack_assert_off {}
xcelium> set severity_pack_assert_off {note warning}
note warning
xcelium> set assert_output_stop_level failed
failed
xcelium> set tcl_debug_level 0
0
xcelium> set relax_path_name 1
1
xcelium> set vhdl_vcdmap XX01ZX01X
XX01ZX01X
xcelium> set intovf_severity_level ERROR
ERROR
xcelium> set probe_screen_format 0
0
xcelium> set rangecnst_severity_level ERROR
ERROR
xcelium> set textio_severity_level ERROR
ERROR
xcelium> set vital_timing_checks_on 1
1
xcelium> set vlog_code_show_force 0
0
xcelium> set assert_count_attempts 1
1
xcelium> set tcl_all64 false
false
xcelium> set tcl_runerror_exit false
false
xcelium> set assert_report_incompletes 0
0
xcelium> set show_force 1
1
xcelium> set force_reset_by_reinvoke 0
0
xcelium> set tcl_relaxed_literal 0
0
xcelium> set probe_exclude_patterns {}
xcelium> set probe_packed_limit 4k
4k
xcelium> set probe_unpacked_limit 16k
16k
xcelium> set assert_internal_msg no
no
xcelium> set svseed 1
1
xcelium> set assert_reporting_mode 0
0
xcelium> set vcd_compact_mode 0
0
xcelium> alias . run
xcelium> alias quit exit
xcelium> database -open -shm -into waves.shm waves -default
Created default SHM database waves
xcelium> probe -create -database waves CLOCK_N_DIVIDER_TB.DUT.INPUT_CLK CLOCK_N_DIVIDER_TB.DUT.OUTPUT_CLK CLOCK_N_DIVIDER_TB.DUT.RST CLOCK_N_DIVIDER_TB.DUT.clk_cycle_counting CLOCK_N_DIVIDER_TB.DUT.divider_index_ceil
xmsim: *SE,PNOOBJ: Path element could not be found: CLOCK_N_DIVIDER_TB.
xmsim: *SE,PNOOBJ: Path element could not be found: CLOCK_N_DIVIDER_TB.
xmsim: *SE,PNOOBJ: Path element could not be found: CLOCK_N_DIVIDER_TB.
xmsim: *SE,PNOOBJ: Path element could not be found: CLOCK_N_DIVIDER_TB.
xmsim: *SE,PNOOBJ: Path element could not be found: CLOCK_N_DIVIDER_TB.
xmsim: *SE,PRNFND: No items are probed because no objects were found that match any specified name.
xcelium> 
xcelium> simvision -input /home/cinovador/Documents/course_files/digital_logic/verilog_files/PT2262-PT2272-enc_dec/oscillator/.simvision/45966_cinovador__autosave.tcl.svcf
xcelium> probe -create -shm CLOCK_DIVIDER_TB.mock_INPUT_CLK CLOCK_DIVIDER_TB.dut_OUTPUT_CLK CLOCK_DIVIDER_TB.mock_RST
Created probe 1
xcelium> run
Simulation complete via $finish(1) at time 248655 NS + 0
./clock_divider_tb.sv:48         $finish;
xcelium> ^C
xcelium> ^C
xcelium> ^C
xcelium> ^C
xcelium> exit
TOOL:	xrun(64)	22.09-s013: Exiting on Dec 16, 2024 at 12:06:27 -03  (total: 00:54:43)
