xrun(64): 22.09-s013: (c) Copyright 1995-2023 Cadence Design Systems, Inc.
TOOL:	xrun(64)	22.09-s013: Started on Nov 13, 2024 at 08:59:27 -03
xrun
	-64bit
	comparator_generic_tb.sv
	comparator_generic.sv
	fast_vdd1v0_basicCells_hvt.v
	+gui
	+access+rw
		Caching library 'worklib' ....... Done
	Elaborating the design hierarchy:
	Top level design units:
		comparator_generic_tb
		ACHCONX2HVT
		ADDFHX1HVT
		ADDFHX2HVT
		ADDFHX4HVT
		ADDFHXLHVT
		ADDFX1HVT
		ADDFX2HVT
		ADDFX4HVT
		ADDFXLHVT
		ADDHX1HVT
		ADDHX2HVT
		ADDHX4HVT
		ADDHXLHVT
		AND2X1HVT
		AND2X2HVT
		AND2X4HVT
		AND2X6HVT
		AND2X8HVT
		AND3X1HVT
		AND3X2HVT
		AND3X4HVT
		AND3X6HVT
		AND3X8HVT
		AND3XLHVT
		AND4X1HVT
		AND4X2HVT
		AND4X4HVT
		AND4X6HVT
		AND4X8HVT
		AND4XLHVT
		ANTENNAHVT
		AO21X1HVT
		AO21X2HVT
		AO21X4HVT
		AO21XLHVT
		AO22X1HVT
		AO22X2HVT
		AO22X4HVT
		AO22XLHVT
		AOI211X1HVT
		AOI211X2HVT
		AOI211X4HVT
		AOI211XLHVT
		AOI21X1HVT
		AOI21X2HVT
		AOI21X4HVT
		AOI21XLHVT
		AOI221X1HVT
		AOI221X2HVT
		AOI221X4HVT
		AOI221XLHVT
		AOI222X1HVT
		AOI222X2HVT
		AOI222X4HVT
		AOI222XLHVT
		AOI22X1HVT
		AOI22X2HVT
		AOI22X4HVT
		AOI22XLHVT
		AOI2BB1X1HVT
		AOI2BB1X2HVT
		AOI2BB1X4HVT
		AOI2BB1XLHVT
		AOI2BB2X1HVT
		AOI2BB2X2HVT
		AOI2BB2X4HVT
		AOI2BB2XLHVT
		AOI31X1HVT
		AOI31X2HVT
		AOI31X4HVT
		AOI31XLHVT
		AOI32X1HVT
		AOI32X2HVT
		AOI32X4HVT
		AOI32XLHVT
		AOI33X1HVT
		AOI33X2HVT
		AOI33X4HVT
		AOI33XLHVT
		BMXIX2HVT
		BMXIX4HVT
		BUFX12HVT
		BUFX16HVT
		BUFX2HVT
		BUFX20HVT
		BUFX3HVT
		BUFX4HVT
		BUFX6HVT
		BUFX8HVT
		CLKAND2X12HVT
		CLKAND2X2HVT
		CLKAND2X3HVT
		CLKAND2X4HVT
		CLKAND2X6HVT
		CLKAND2X8HVT
		CLKBUFX12HVT
		CLKBUFX16HVT
		CLKBUFX2HVT
		CLKBUFX20HVT
		CLKBUFX3HVT
		CLKBUFX4HVT
		CLKBUFX6HVT
		CLKBUFX8HVT
		CLKINVX1HVT
		CLKINVX12HVT
		CLKINVX16HVT
		CLKINVX2HVT
		CLKINVX20HVT
		CLKINVX3HVT
		CLKINVX4HVT
		CLKINVX6HVT
		CLKINVX8HVT
		CLKMX2X12HVT
		CLKMX2X2HVT
		CLKMX2X3HVT
		CLKMX2X4HVT
		CLKMX2X6HVT
		CLKMX2X8HVT
		CLKXOR2X1HVT
		CLKXOR2X2HVT
		CLKXOR2X4HVT
		CLKXOR2X8HVT
		DFFHQX1HVT
		DFFHQX2HVT
		DFFHQX4HVT
		DFFHQX8HVT
		DFFNSRX1HVT
		DFFNSRX2HVT
		DFFNSRX4HVT
		DFFNSRXLHVT
		DFFQX1HVT
		DFFQX2HVT
		DFFQX4HVT
		DFFQXLHVT
		DFFRHQX1HVT
		DFFRHQX2HVT
		DFFRHQX4HVT
		DFFRHQX8HVT
		DFFRX1HVT
		DFFRX2HVT
		DFFRX4HVT
		DFFRXLHVT
		DFFSHQX1HVT
		DFFSHQX2HVT
		DFFSHQX4HVT
		DFFSHQX8HVT
		DFFSRHQX1HVT
		DFFSRHQX2HVT
		DFFSRHQX4HVT
		DFFSRHQX8HVT
		DFFSRX1HVT
		DFFSRX2HVT
		DFFSRX4HVT
		DFFSRXLHVT
		DFFSX1HVT
		DFFSX2HVT
		DFFSX4HVT
		DFFSXLHVT
		DFFTRX1HVT
		DFFTRX2HVT
		DFFTRX4HVT
		DFFTRXLHVT
		DFFX1HVT
		DFFX2HVT
		DFFX4HVT
		DFFXLHVT
		DLY1X1HVT
		DLY1X4HVT
		DLY2X1HVT
		DLY2X4HVT
		DLY3X1HVT
		DLY3X4HVT
		DLY4X1HVT
		DLY4X4HVT
		EDFFHQX1HVT
		EDFFHQX2HVT
		EDFFHQX4HVT
		EDFFHQX8HVT
		EDFFTRX1HVT
		EDFFTRX2HVT
		EDFFTRX4HVT
		EDFFTRXLHVT
		EDFFX1HVT
		EDFFX2HVT
		EDFFX4HVT
		EDFFXLHVT
		HOLDX1HVT
		INVX1HVT
		INVX12HVT
		INVX16HVT
		INVX2HVT
		INVX20HVT
		INVX3HVT
		INVX4HVT
		INVX6HVT
		INVX8HVT
		INVXLHVT
		MDFFHQX1HVT
		MDFFHQX2HVT
		MDFFHQX4HVT
		MDFFHQX8HVT
		MX2X1HVT
		MX2X2HVT
		MX2X4HVT
		MX2X6HVT
		MX2X8HVT
		MX2XLHVT
		MX3X1HVT
		MX3X2HVT
		MX3X4HVT
		MX3XLHVT
		MX4X1HVT
		MX4X2HVT
		MX4X4HVT
		MX4XLHVT
		MXI2X1HVT
		MXI2X2HVT
		MXI2X4HVT
		MXI2X6HVT
		MXI2X8HVT
		MXI2XLHVT
		MXI3X1HVT
		MXI3X2HVT
		MXI3X4HVT
		MXI3XLHVT
		MXI4X1HVT
		MXI4X2HVT
		MXI4X4HVT
		MXI4XLHVT
		NAND2BX1HVT
		NAND2BX2HVT
		NAND2BX4HVT
		NAND2BXLHVT
		NAND2X1HVT
		NAND2X2HVT
		NAND2X4HVT
		NAND2X6HVT
		NAND2X8HVT
		NAND2XLHVT
		NAND3BX1HVT
		NAND3BX2HVT
		NAND3BX4HVT
		NAND3BXLHVT
		NAND3X1HVT
		NAND3X2HVT
		NAND3X4HVT
		NAND3X6HVT
		NAND3X8HVT
		NAND3XLHVT
		NAND4BBX1HVT
		NAND4BBX2HVT
		NAND4BBX4HVT
		NAND4BBXLHVT
		NAND4BX1HVT
		NAND4BX2HVT
		NAND4BX4HVT
		NAND4BXLHVT
		NAND4X1HVT
		NAND4X2HVT
		NAND4X4HVT
		NAND4X6HVT
		NAND4X8HVT
		NAND4XLHVT
		NOR2BX1HVT
		NOR2BX2HVT
		NOR2BX4HVT
		NOR2BXLHVT
		NOR2X1HVT
		NOR2X2HVT
		NOR2X4HVT
		NOR2X6HVT
		NOR2X8HVT
		NOR3BX1HVT
		NOR3BX2HVT
		NOR3BX4HVT
		NOR3BXLHVT
		NOR3X1HVT
		NOR3X2HVT
		NOR3X4HVT
		NOR3X6HVT
		NOR3X8HVT
		NOR3XLHVT
		NOR4BBX1HVT
		NOR4BBX2HVT
		NOR4BBX4HVT
		NOR4BBXLHVT
		NOR4BX1HVT
		NOR4BX2HVT
		NOR4BX4HVT
		NOR4BXLHVT
		NOR4X1HVT
		NOR4X2HVT
		NOR4X4HVT
		NOR4X6HVT
		NOR4X8HVT
		NOR4XLHVT
		OA21X1HVT
		OA21X2HVT
		OA21X4HVT
		OA21XLHVT
		OA22X1HVT
		OA22X2HVT
		OA22X4HVT
		OA22XLHVT
		OAI211X1HVT
		OAI211X2HVT
		OAI211X4HVT
		OAI211XLHVT
		OAI21X1HVT
		OAI21X2HVT
		OAI21X4HVT
		OAI21XLHVT
		OAI221X1HVT
		OAI221X2HVT
		OAI221X4HVT
		OAI221XLHVT
		OAI222X1HVT
		OAI222X2HVT
		OAI222X4HVT
		OAI222XLHVT
		OAI22X1HVT
		OAI22X2HVT
		OAI22X4HVT
		OAI22XLHVT
		OAI2BB1X1HVT
		OAI2BB1X2HVT
		OAI2BB1X4HVT
		OAI2BB1XLHVT
		OAI2BB2X1HVT
		OAI2BB2X2HVT
		OAI2BB2X4HVT
		OAI2BB2XLHVT
		OAI31X1HVT
		OAI31X2HVT
		OAI31X4HVT
		OAI31XLHVT
		OAI32X1HVT
		OAI32X2HVT
		OAI32X4HVT
		OAI32XLHVT
		OAI33X1HVT
		OAI33X2HVT
		OAI33X4HVT
		OAI33XLHVT
		OR2X1HVT
		OR2X2HVT
		OR2X4HVT
		OR2X6HVT
		OR2X8HVT
		OR2XLHVT
		OR3X1HVT
		OR3X2HVT
		OR3X4HVT
		OR3X6HVT
		OR3X8HVT
		OR3XLHVT
		OR4X1HVT
		OR4X2HVT
		OR4X4HVT
		OR4X6HVT
		OR4X8HVT
		OR4XLHVT
		SDFFHQX1HVT
		SDFFHQX2HVT
		SDFFHQX4HVT
		SDFFHQX8HVT
		SDFFNSRX1HVT
		SDFFNSRX2HVT
		SDFFNSRX4HVT
		SDFFNSRXLHVT
		SDFFQX1HVT
		SDFFQX2HVT
		SDFFQX4HVT
		SDFFQXLHVT
		SDFFRHQX1HVT
		SDFFRHQX2HVT
		SDFFRHQX4HVT
		SDFFRHQX8HVT
		SDFFRX1HVT
		SDFFRX2HVT
		SDFFRX4HVT
		SDFFRXLHVT
		SDFFSHQX1HVT
		SDFFSHQX2HVT
		SDFFSHQX4HVT
		SDFFSHQX8HVT
		SDFFSRHQX1HVT
		SDFFSRHQX2HVT
		SDFFSRHQX4HVT
		SDFFSRHQX8HVT
		SDFFSRX1HVT
		SDFFSRX2HVT
		SDFFSRX4HVT
		SDFFSRXLHVT
		SDFFSX1HVT
		SDFFSX2HVT
		SDFFSX4HVT
		SDFFSXLHVT
		SDFFTRX1HVT
		SDFFTRX2HVT
		SDFFTRX4HVT
		SDFFTRXLHVT
		SDFFX1HVT
		SDFFX2HVT
		SDFFX4HVT
		SDFFXLHVT
		SEDFFHQX1HVT
		SEDFFHQX2HVT
		SEDFFHQX4HVT
		SEDFFHQX8HVT
		SEDFFTRX1HVT
		SEDFFTRX2HVT
		SEDFFTRX4HVT
		SEDFFTRXLHVT
		SEDFFX1HVT
		SEDFFX2HVT
		SEDFFX4HVT
		SEDFFXLHVT
		SMDFFHQX1HVT
		SMDFFHQX2HVT
		SMDFFHQX4HVT
		SMDFFHQX8HVT
		TBUFX1HVT
		TBUFX12HVT
		TBUFX16HVT
		TBUFX2HVT
		TBUFX20HVT
		TBUFX3HVT
		TBUFX4HVT
		TBUFX6HVT
		TBUFX8HVT
		TBUFXLHVT
		TIEHIHVT
		TIELOHVT
		TLATNCAX12HVT
		TLATNCAX16HVT
		TLATNCAX2HVT
		TLATNCAX20HVT
		TLATNCAX3HVT
		TLATNCAX4HVT
		TLATNCAX6HVT
		TLATNCAX8HVT
		TLATNSRX1HVT
		TLATNSRX2HVT
		TLATNSRX4HVT
		TLATNSRXLHVT
		TLATNTSCAX12HVT
		TLATNTSCAX16HVT
		TLATNTSCAX2HVT
		TLATNTSCAX20HVT
		TLATNTSCAX3HVT
		TLATNTSCAX4HVT
		TLATNTSCAX6HVT
		TLATNTSCAX8HVT
		TLATNX1HVT
		TLATNX2HVT
		TLATNX4HVT
		TLATNXLHVT
		TLATSRX1HVT
		TLATSRX2HVT
		TLATSRX4HVT
		TLATSRXLHVT
		TLATX1HVT
		TLATX2HVT
		TLATX4HVT
		TLATXLHVT
		XNOR2X1HVT
		XNOR2X2HVT
		XNOR2X4HVT
		XNOR2XLHVT
		XNOR3X1HVT
		XNOR3XLHVT
		XOR2X1HVT
		XOR2X2HVT
		XOR2X4HVT
		XOR3X1HVT
		XOR3XLHVT
xmelab: *W,DSEMEL: This SystemVerilog design will be simulated as per IEEE 1800-2009 SystemVerilog simulation semantics. Use -disable_sem2009 option for turning off SV 2009 simulation semantics.
	Building instance overlay tables: .................... Done
	Generating native compiled code:
		worklib.comparator_generic:sv <0x396c5bdc>
			streams:   9, words:  3461
		worklib.comparator_generic_tb:sv <0x702416c0>
			streams:   6, words: 24765
	Building instance specific data structures.
	Loading native compiled code:     .................... Done
	Design hierarchy summary:
		                    Instances  Unique
		Modules:                  486     482
		UDPs:                     272      14
		Primitives:              1847       6
		Timing outputs:           572     416
		Registers:                168     182
		Scalar wires:            2883       -
		Expanded wires:             8       2
		Initial blocks:             2       2
		Pseudo assignments:        12      12
		Timing checks:           1976       -
		Delayed tcheck signals:   536     536
		Assertions:                10      10
		Simulation timescale:    10ps
	Writing initial simulation snapshot: worklib.comparator_generic_tb:sv
xmsim: *W,NOMTDGUI: Multi-Threaded Dumping is disabled for interactive debug mode.
xmsim: *W,DSEM2009: This SystemVerilog design is simulated as per IEEE 1800-2009 SystemVerilog simulation semantics. Use -disable_sem2009 option for turning off SV 2009 simulation semantics.

-------------------------------------
Relinquished control to SimVision...
xcelium> 
xcelium> source /home/tools/cadence/installs/XCELIUM2209/tools/xcelium/files/xmsimrc
xcelium> run
                Tempo          Entradas            Saídas
                        first_in    second_in       out
                ====   ==========   ==========      ====
                   0     0000         0000           1
                   5     0001         0000           0
                  10     0010         0010           1
                  15     1111         1110           0
                  20     1010         1010           1
                  25     0101         0101           1
                  30     0110         0101           0
                  35     1001         1000           0
                  40     0111         0111           1
                  45     1100         1101           0
Simulation complete via $finish(1) at time 50 NS + 0
./comparator_generic_tb.sv:76       $finish;
xcelium> database -open waves -into waves.shm -default
Created default SHM database waves
xcelium> probe -create -shm comparator_generic_tb.cmp_inst.first_word comparator_generic_tb.cmp_inst.mid_out comparator_generic_tb.cmp_inst.out comparator_generic_tb.cmp_inst.second_word comparator_generic_tb.cmp_inst.xor_result
Created probe 1
xcelium> run
xmsim: *E,RNFNSH: Cannot continue simulation due to a previous $finish.
xcelium> run
xmsim: *E,RNFNSH: Cannot continue simulation due to a previous $finish.
xcelium> reset
xmsim: *W,DSEM2009: This SystemVerilog design is simulated as per IEEE 1800-2009 SystemVerilog simulation semantics. Use -disable_sem2009 option for turning off SV 2009 simulation semantics.
Loaded snapshot worklib.comparator_generic_tb:sv
xcelium> reset
xmsim: *W,DSEM2009: This SystemVerilog design is simulated as per IEEE 1800-2009 SystemVerilog simulation semantics. Use -disable_sem2009 option for turning off SV 2009 simulation semantics.
Loaded snapshot worklib.comparator_generic_tb:sv
xcelium> reset
xmsim: *W,DSEM2009: This SystemVerilog design is simulated as per IEEE 1800-2009 SystemVerilog simulation semantics. Use -disable_sem2009 option for turning off SV 2009 simulation semantics.
Loaded snapshot worklib.comparator_generic_tb:sv
xcelium> run
                Tempo          Entradas            Saídas
                        first_in    second_in       out
                ====   ==========   ==========      ====
                   0     0000         0000           1
                   5     0001         0000           0
                  10     0010         0010           1
                  15     1111         1110           0
                  20     1010         1010           1
                  25     0101         0101           1
                  30     0110         0101           0
                  35     1001         1000           0
                  40     0111         0111           1
                  45     1100         1101           0
Simulation complete via $finish(1) at time 50 NS + 0
./comparator_generic_tb.sv:76       $finish;
xcelium> 