xrun(64): 24.09-s001: (c) Copyright 1995-2024 Cadence Design Systems, Inc.
TOOL:	xrun(64)	24.09-s001: Started on Feb 24, 2025 at 09:17:12 -03
xrun
	-64bit
	ieee754multiplier_tb.sv
	ieee754multiplier.sv
	+gui
	+access+rw
		Caching library 'worklib' ....... Done
	Elaborating the design hierarchy:
	Top level design units:
		multiplier_tb
	Building instance overlay tables: .................... Done
	Generating native compiled code:
		worklib.multiplier:sv <0x7d85cb2c>
			streams:   6, words:  4037
		worklib.multiplier_tb:sv <0x5bbbb4ee>
			streams:   7, words:  9284
	Building instance specific data structures.
	Loading native compiled code:     .................... Done
	Design hierarchy summary:
		                 Instances  Unique
		Modules:                 2       2
		Registers:              17      17
		Scalar wires:            2       -
		Vectored wires:          4       -
		Always blocks:           2       2
		Initial blocks:          2       2
		Pseudo assignments:      5       -
		Process Clocks:          1       1
		Simulation timescale:  1ps
	Writing initial simulation snapshot: worklib.multiplier_tb:sv
xmsim: *W,NOMTDGUI: Multi-Threaded Dumping is disabled for interactive debug mode.

-------------------------------------
Relinquished control to SimVision...
xcelium> 
xcelium> source /home/tools/cadence/installs/XCELIUM2209/tools/xcelium/files/xmsimrc
xcelium> database -open waves -into waves.shm -default
Created default SHM database waves
xcelium> probe -create -shm multiplier_tb.DUT.clk multiplier_tb.DUT.exponent_a multiplier_tb.DUT.exponent_b multiplier_tb.DUT.exponent_temp multiplier_tb.DUT.input_a multiplier_tb.DUT.input_b multiplier_tb.DUT.mantissa_a multiplier_tb.DUT.mantissa_b multiplier_tb.DUT.mantissa_result multiplier_tb.DUT.mantissa_temp multiplier_tb.DUT.reset multiplier_tb.DUT.result multiplier_tb.DUT.signal_a multiplier_tb.DUT.signal_b
Created probe 1
xcelium> run
Result Bits: 01000001100001000000000000000000
Result: 16.500000
Expected: 16.500000
Result Bits: 01000000000111110011110010000001
Result: 2.488068
Expected: 2.488068
Result Bits: 00000000000000000000000000000000
Result: 0.000000
Expected: 0.000000
Simulation complete via $finish(1) at time 60 NS + 0
./ieee754multiplier_tb.sv:73     $finish;
xcelium> probe -create -shm multiplier_tb.clk multiplier_tb.input_a multiplier_tb.input_b multiplier_tb.mock_a multiplier_tb.mock_b multiplier_tb.reset multiplier_tb.result
Created probe 2
xcelium> run
xmsim: *E,RNFNSH: Cannot continue simulation due to a previous $finish.
xcelium> reset
Loaded snapshot worklib.multiplier_tb:sv
xcelium> run
Result Bits: 01000001100001000000000000000000
Result: 16.500000
Expected: 16.500000
Result Bits: 01000000000111110011110010000001
Result: 2.488068
Expected: 2.488068
Result Bits: 00000000000000000000000000000000
Result: 0.000000
Expected: 0.000000
Simulation complete via $finish(1) at time 60 NS + 0
./ieee754multiplier_tb.sv:73     $finish;
xcelium> ^C
xcelium> exit
TOOL:	xrun(64)	24.09-s001: Exiting on Feb 24, 2025 at 09:19:51 -03  (total: 00:02:39)
