xrun(64): 24.09-s001: (c) Copyright 1995-2024 Cadence Design Systems, Inc.
TOOL:	xrun(64)	24.09-s001: Started on Jan 10, 2025 at 12:25:53 -03
xrun
	-64bit
	/home/cinovador/Documents/course_files/digital_logic/verilog_files/PT2262-PT2272-enc_dec/encoder/codificador_pt2262_tb.sv
	/home/cinovador/Documents/course_files/digital_logic/verilog_files/PT2262-PT2272-enc_dec/encoder/codificador_pt2262.v
	/home/cinovador/Documents/course_files/digital_logic/verilog_files/PT2262-PT2272-enc_dec/libs/fast_vdd1v2_basicCells.v
	/home/cinovador/Documents/course_files/digital_logic/verilog_files/PT2262-PT2272-enc_dec/addr_interpreter/comp_endereco.sv
	/home/cinovador/Documents/course_files/digital_logic/verilog_files/PT2262-PT2272-enc_dec/bit_gen/bit_generator.sv
	/home/cinovador/Documents/course_files/digital_logic/verilog_files/PT2262-PT2272-enc_dec/oscillator/clock_divider.sv
	+access+rw
	+gui
	-s
	-input restore_enc_synth.tcl
Recompiling... reason: file './encoder/codificador_pt2262.v' is newer than expected.
	expected: Fri Jan 10 12:14:14 2025
	actual:   Fri Jan 10 12:25:50 2025
file: /home/cinovador/Documents/course_files/digital_logic/verilog_files/PT2262-PT2272-enc_dec/encoder/codificador_pt2262.v
	module worklib.codificador_pt2262:v
		errors: 0, warnings: 0
file: /home/cinovador/Documents/course_files/digital_logic/verilog_files/PT2262-PT2272-enc_dec/oscillator/clock_divider.sv
	module worklib.CLOCK_DIVIDER:sv
		errors: 0, warnings: 0
		Caching library 'worklib' ....... Done
	Elaborating the design hierarchy:
	Top level design units:
		codificador_pt2262_tb
		ACHCONX2
		ADDFHX1
		ADDFHX2
		ADDFHX4
		ADDFHXL
		ADDFX1
		ADDFX2
		ADDFX4
		ADDFXL
		ADDHX1
		ADDHX2
		ADDHX4
		ADDHXL
		AND2X2
		AND2X4
		AND2X6
		AND2X8
		AND2XL
		AND3X1
		AND3X2
		AND3X4
		AND3X6
		AND3X8
		AND3XL
		AND4X1
		AND4X2
		AND4X4
		AND4X6
		AND4X8
		AND4XL
		ANTENNA
		AO21X1
		AO21X2
		AO21X4
		AO21XL
		AO22X1
		AO22X2
		AO22X4
		AO22XL
		AOI211X1
		AOI211X2
		AOI211X4
		AOI21X1
		AOI21X2
		AOI21X4
		AOI221X2
		AOI221X4
		AOI221XL
		AOI222X1
		AOI222X2
		AOI222X4
		AOI222XL
		AOI22X1
		AOI22X2
		AOI22X4
		AOI2BB1X1
		AOI2BB1X2
		AOI2BB1X4
		AOI2BB2X1
		AOI2BB2X2
		AOI2BB2X4
		AOI2BB2XL
		AOI31X1
		AOI31X2
		AOI31X4
		AOI31XL
		AOI32X1
		AOI32X2
		AOI32X4
		AOI32XL
		AOI33X1
		AOI33X2
		AOI33X4
		BMXIX2
		BMXIX4
		BUFX12
		BUFX16
		BUFX2
		BUFX20
		BUFX3
		BUFX4
		BUFX6
		BUFX8
		CLKAND2X12
		CLKAND2X2
		CLKAND2X3
		CLKAND2X4
		CLKAND2X6
		CLKAND2X8
		CLKBUFX12
		CLKBUFX16
		CLKBUFX2
		CLKBUFX20
		CLKBUFX3
		CLKBUFX4
		CLKBUFX6
		CLKBUFX8
		CLKINVX1
		CLKINVX12
		CLKINVX16
		CLKINVX2
		CLKINVX20
		CLKINVX3
		CLKINVX4
		CLKINVX6
		CLKINVX8
		CLKMX2X12
		CLKMX2X2
		CLKMX2X3
		CLKMX2X4
		CLKMX2X6
		CLKMX2X8
		CLKXOR2X1
		CLKXOR2X2
		CLKXOR2X4
		CLKXOR2X8
		DECAP10
		DECAP2
		DECAP3
		DECAP4
		DECAP5
		DECAP6
		DECAP7
		DECAP8
		DECAP9
		DFFHQX2
		DFFHQX4
		DFFHQX8
		DFFNSRX1
		DFFNSRX2
		DFFNSRX4
		DFFNSRXL
		DFFQX1
		DFFQX2
		DFFQX4
		DFFQXL
		DFFRHQX2
		DFFRHQX4
		DFFRHQX8
		DFFRX2
		DFFRX4
		DFFRXL
		DFFSHQX2
		DFFSHQX4
		DFFSHQX8
		DFFSRHQX1
		DFFSRHQX2
		DFFSRHQX4
		DFFSRHQX8
		DFFSRX1
		DFFSRX2
		DFFSRX4
		DFFSRXL
		DFFSX1
		DFFSX2
		DFFSX4
		DFFSXL
		DFFTRX1
		DFFTRX2
		DFFTRX4
		DFFTRXL
		DFFX1
		DFFX2
		DFFX4
		DFFXL
		DLY1X1
		DLY1X4
		DLY2X1
		DLY2X4
		DLY3X1
		DLY3X4
		DLY4X1
		DLY4X4
		EDFFHQX1
		EDFFHQX2
		EDFFHQX4
		EDFFHQX8
		EDFFTRX1
		EDFFTRX2
		EDFFTRX4
		EDFFTRXL
		EDFFX1
		EDFFX2
		EDFFX4
		EDFFXL
		HOLDX1
		INVX12
		INVX16
		INVX2
		INVX20
		INVX3
		INVX4
		INVX6
		INVX8
		MDFFHQX1
		MDFFHQX2
		MDFFHQX4
		MDFFHQX8
		MX2X2
		MX2X4
		MX2X6
		MX2X8
		MX2XL
		MX3X1
		MX3X2
		MX3X4
		MX3XL
		MX4X1
		MX4X2
		MX4X4
		MX4XL
		MXI2X1
		MXI2X2
		MXI2X4
		MXI2X6
		MXI2X8
		MXI2XL
		MXI3X1
		MXI3X2
		MXI3X4
		MXI3XL
		MXI4X1
		MXI4X2
		MXI4X4
		MXI4XL
		NAND2BX2
		NAND2BX4
		NAND2X1
		NAND2X2
		NAND2X4
		NAND2X6
		NAND2X8
		NAND3BX1
		NAND3BX2
		NAND3BX4
		NAND3X1
		NAND3X2
		NAND3X4
		NAND3X6
		NAND3X8
		NAND3XL
		NAND4BBX1
		NAND4BBX2
		NAND4BBX4
		NAND4BBXL
		NAND4BX1
		NAND4BX2
		NAND4BX4
		NAND4X1
		NAND4X2
		NAND4X4
		NAND4X6
		NAND4X8
		NOR2BX2
		NOR2BX4
		NOR2BXL
		NOR2X1
		NOR2X2
		NOR2X4
		NOR2X6
		NOR2X8
		NOR3BX1
		NOR3BX2
		NOR3BX4
		NOR3X1
		NOR3X2
		NOR3X4
		NOR3X6
		NOR3X8
		NOR3XL
		NOR4BBX1
		NOR4BBX2
		NOR4BBX4
		NOR4BBXL
		NOR4BX2
		NOR4BX4
		NOR4BXL
		NOR4X2
		NOR4X4
		NOR4X6
		NOR4X8
		NOR4XL
		OA21X2
		OA21X4
		OA21XL
		OA22X1
		OA22X2
		OA22X4
		OA22XL
		OAI211X2
		OAI211X4
		OAI211XL
		OAI21X1
		OAI21X2
		OAI21X4
		OAI21XL
		OAI221X1
		OAI221X2
		OAI221X4
		OAI221XL
		OAI222X1
		OAI222X2
		OAI222X4
		OAI222XL
		OAI22X2
		OAI22X4
		OAI2BB1X2
		OAI2BB1X4
		OAI2BB1XL
		OAI2BB2X1
		OAI2BB2X2
		OAI2BB2X4
		OAI2BB2XL
		OAI31X2
		OAI31X4
		OAI31XL
		OAI32X2
		OAI32X4
		OAI32XL
		OAI33X1
		OAI33X2
		OAI33X4
		OAI33XL
		OR2X2
		OR2X4
		OR2X6
		OR2X8
		OR2XL
		OR3X1
		OR3X2
		OR3X4
		OR3X6
		OR3X8
		OR3XL
		OR4X1
		OR4X2
		OR4X4
		OR4X6
		OR4X8
		OR4XL
		SDFFHQX1
		SDFFHQX2
		SDFFHQX4
		SDFFHQX8
		SDFFNSRX1
		SDFFNSRX2
		SDFFNSRX4
		SDFFNSRXL
		SDFFQX1
		SDFFQX2
		SDFFQX4
		SDFFQXL
		SDFFRHQX2
		SDFFRHQX4
		SDFFRHQX8
		SDFFRX1
		SDFFRX2
		SDFFRX4
		SDFFRXL
		SDFFSHQX1
		SDFFSHQX2
		SDFFSHQX4
		SDFFSHQX8
		SDFFSRHQX1
		SDFFSRHQX2
		SDFFSRHQX4
		SDFFSRHQX8
		SDFFSRX1
		SDFFSRX2
		SDFFSRX4
		SDFFSRXL
		SDFFSX1
		SDFFSX2
		SDFFSX4
		SDFFSXL
		SDFFTRX1
		SDFFTRX2
		SDFFTRX4
		SDFFTRXL
		SDFFX1
		SDFFX2
		SDFFX4
		SDFFXL
		SEDFFHQX1
		SEDFFHQX2
		SEDFFHQX4
		SEDFFHQX8
		SEDFFTRX1
		SEDFFTRX2
		SEDFFTRX4
		SEDFFTRXL
		SEDFFX1
		SEDFFX2
		SEDFFX4
		SEDFFXL
		SMDFFHQX1
		SMDFFHQX2
		SMDFFHQX4
		SMDFFHQX8
		TBUFX1
		TBUFX12
		TBUFX16
		TBUFX2
		TBUFX20
		TBUFX3
		TBUFX4
		TBUFX6
		TBUFX8
		TBUFXL
		TIEHI
		TIELO
		TLATNCAX12
		TLATNCAX16
		TLATNCAX2
		TLATNCAX20
		TLATNCAX3
		TLATNCAX4
		TLATNCAX6
		TLATNCAX8
		TLATNSRX1
		TLATNSRX2
		TLATNSRX4
		TLATNSRXL
		TLATNTSCAX12
		TLATNTSCAX16
		TLATNTSCAX2
		TLATNTSCAX20
		TLATNTSCAX3
		TLATNTSCAX4
		TLATNTSCAX6
		TLATNTSCAX8
		TLATNX1
		TLATNX2
		TLATNX4
		TLATNXL
		TLATSRX1
		TLATSRX2
		TLATSRX4
		TLATSRXL
		TLATX1
		TLATX2
		TLATX4
		TLATXL
		XNOR2X2
		XNOR2X4
		XNOR2XL
		XNOR3X1
		XNOR3XL
		XOR2X1
		XOR2X2
		XOR2X4
		XOR2XL
		XOR3X1
		XOR3XL
		BIT_GENERATOR
		CLOCK_DIVIDER
	Building instance overlay tables: .................... Done
	Generating native compiled code:
		worklib.CLOCK_DIVIDER:sv <0x79e709dc>
			streams:   4, words:  1039
		worklib.codificador_pt2262_tb:sv <0x5d62dde1>
			streams:   8, words:  4820
	Building instance specific data structures.
	Loading native compiled code:     .................... Done
	Design hierarchy summary:
		                     Instances  Unique
		Modules:                   669     495
		UDPs:                      328      14
		Primitives:              2,201       6
		Timing outputs:            744     424
		Registers:                 203     189
		Scalar wires:            2,973       -
		Expanded wires:             20       3
		Vectored wires:              3       -
		Always blocks:               7       7
		Initial blocks:              2       2
		Cont. assignments:           1       1
		Pseudo assignments:          6       -
		Timing checks:           2,176       -
		Delayed tcheck signals:    594     561
		Process Clocks:              5       3
		Simulation timescale:      1ps
	Writing initial simulation snapshot: worklib.codificador_pt2262_tb:sv
xmsim: *W,NOMTDGUI: Multi-Threaded Dumping is disabled for interactive debug mode.

-------------------------------------
Relinquished control to SimVision...
xcelium> 
xcelium> source /home/tools/cadence/installs/XCELIUM2209/tools/xcelium/files/xmsimrc
xcelium> 
xcelium> # XM-Sim Command File
xcelium> # TOOL:	xmsim(64)	24.09-s001
xcelium> #
xcelium> #
xcelium> # You can restore this configuration with:
xcelium> #
xcelium> #      xrun -64bit /home/cinovador/Documents/course_files/digital_logic/verilog_files/PT2262-PT2272-enc_dec/encoder/codificador_pt2262_tb.sv /home/cinovador/Documents/course_files/digital_logic/verilog_files/PT2262-PT2272-enc_dec/encoder/codificador_pt2262.v /home/cinovador/Documents/course_files/digital_logic/verilog_files/PT2262-PT2272-enc_dec/libs/fast_vdd1v2_basicCells.v /home/cinovador/Documents/course_files/digital_logic/verilog_files/PT2262-PT2272-enc_dec/addr_interpreter/comp_endereco.sv /home/cinovador/Documents/course_files/digital_logic/verilog_files/PT2262-PT2272-enc_dec/bit_gen/bit_generator.sv /home/cinovador/Documents/course_files/digital_logic/verilog_files/PT2262-PT2272-enc_dec/oscillator/clock_divider.sv +access+rw +gui -s -input restore_enc_synth.tcl -input /home/cinovador/Documents/course_files/digital_logic/verilog_files/PT2262-PT2272-enc_dec/restore_enc_synth.tcl
xcelium> #
xcelium> 
xcelium> set tcl_prompt1 {puts -nonewline "xcelium> "}
puts -nonewline "xcelium> "
xcelium> set tcl_prompt2 {puts -nonewline "> "}
puts -nonewline "> "
xcelium> set vlog_format %h
%h
xcelium> set vhdl_format %v
%v
xcelium> set real_precision 6
6
xcelium> set display_unit auto
auto
xcelium> set time_unit module
module
xcelium> set heap_garbage_size -200
-200
xcelium> set heap_garbage_time 0
0
xcelium> set assert_report_level note
note
xcelium> set assert_stop_level error
error
xcelium> set autoscope yes
yes
xcelium> set assert_1164_warnings yes
yes
xcelium> set pack_assert_off {}
xcelium> set severity_pack_assert_off {note warning}
note warning
xcelium> set assert_output_stop_level failed
failed
xcelium> set tcl_debug_level 0
0
xcelium> set relax_path_name 1
1
xcelium> set vhdl_vcdmap XX01ZX01X
XX01ZX01X
xcelium> set intovf_severity_level ERROR
ERROR
xcelium> set probe_screen_format 0
0
xcelium> set rangecnst_severity_level ERROR
ERROR
xcelium> set textio_severity_level ERROR
ERROR
xcelium> set vital_timing_checks_on 1
1
xcelium> set vlog_code_show_force 0
0
xcelium> set assert_count_attempts 1
1
xcelium> set tcl_all64 false
false
xcelium> set tcl_runerror_exit false
false
xcelium> set assert_report_incompletes 0
0
xcelium> set show_force 1
1
xcelium> set force_reset_by_reinvoke 0
0
xcelium> set tcl_relaxed_literal 0
0
xcelium> set probe_exclude_patterns {}
xcelium> set probe_packed_limit 4k
4k
xcelium> set probe_unpacked_limit 16k
16k
xcelium> set assert_internal_msg no
no
xcelium> set svseed 1
1
xcelium> set assert_reporting_mode 0
0
xcelium> set vcd_compact_mode 0
0
xcelium> set vhdl_forgen_loopindex_enum_pos 0
0
xcelium> set xmreplay_dc_debug 0
0
xcelium> set tcl_runcmd_interrupt next_command
next_command
xcelium> set tcl_sigval_prefix {#}
#
xcelium> alias . run
xcelium> alias indago verisium
xcelium> alias quit exit
xcelium> database -open -shm -into waves.shm waves -default
Created default SHM database waves
xcelium> probe -create -database waves codificador_pt2262_tb.DUT.A codificador_pt2262_tb.DUT.D codificador_pt2262_tb.DUT.F_BIT_LOCATOR codificador_pt2262_tb.DUT.INTERPRETED_ADDR codificador_pt2262_tb.DUT.bit_gen_input codificador_pt2262_tb.DUT.clk codificador_pt2262_tb.DUT.cod_o codificador_pt2262_tb.DUT.current_state codificador_pt2262_tb.DUT.internal_oscillator_clk_cycle_counting codificador_pt2262_tb.DUT.n_0 codificador_pt2262_tb.DUT.n_1 codificador_pt2262_tb.DUT.n_2 codificador_pt2262_tb.DUT.n_3 codificador_pt2262_tb.DUT.n_4 codificador_pt2262_tb.DUT.n_5 codificador_pt2262_tb.DUT.n_6 codificador_pt2262_tb.DUT.n_7 codificador_pt2262_tb.DUT.n_8 codificador_pt2262_tb.DUT.n_9 codificador_pt2262_tb.DUT.n_10 codificador_pt2262_tb.DUT.n_11 codificador_pt2262_tb.DUT.n_12 codificador_pt2262_tb.DUT.n_13 codificador_pt2262_tb.DUT.n_14 codificador_pt2262_tb.DUT.n_17 codificador_pt2262_tb.DUT.n_18 codificador_pt2262_tb.DUT.n_19 codificador_pt2262_tb.DUT.n_20 codificador_pt2262_tb.DUT.n_21 codificador_pt2262_tb.DUT.n_22 codificador_pt2262_tb.DUT.n_24 codificador_pt2262_tb.DUT.n_25 codificador_pt2262_tb.DUT.n_26 codificador_pt2262_tb.DUT.n_27 codificador_pt2262_tb.DUT.n_28 codificador_pt2262_tb.DUT.n_29 codificador_pt2262_tb.DUT.n_30 codificador_pt2262_tb.DUT.n_31 codificador_pt2262_tb.DUT.n_32 codificador_pt2262_tb.DUT.n_33 codificador_pt2262_tb.DUT.n_34 codificador_pt2262_tb.DUT.n_35 codificador_pt2262_tb.DUT.n_36 codificador_pt2262_tb.DUT.n_37 codificador_pt2262_tb.DUT.n_38 codificador_pt2262_tb.DUT.n_41 codificador_pt2262_tb.DUT.n_42 codificador_pt2262_tb.DUT.n_43 codificador_pt2262_tb.DUT.n_44 codificador_pt2262_tb.DUT.n_45 codificador_pt2262_tb.DUT.n_46 codificador_pt2262_tb.DUT.n_47 codificador_pt2262_tb.DUT.n_48 codificador_pt2262_tb.DUT.n_49 codificador_pt2262_tb.DUT.n_50 codificador_pt2262_tb.DUT.n_51 codificador_pt2262_tb.DUT.n_53 codificador_pt2262_tb.DUT.n_54 codificador_pt2262_tb.DUT.n_55 codificador_pt2262_tb.DUT.n_56 codificador_pt2262_tb.DUT.n_57 codificador_pt2262_tb.DUT.n_58 codificador_pt2262_tb.DUT.n_59 codificador_pt2262_tb.DUT.n_61 codificador_pt2262_tb.DUT.n_62 codificador_pt2262_tb.DUT.n_63 codificador_pt2262_tb.DUT.n_65 codificador_pt2262_tb.DUT.n_66 codificador_pt2262_tb.DUT.n_67 codificador_pt2262_tb.DUT.n_68 codificador_pt2262_tb.DUT.n_69 codificador_pt2262_tb.DUT.n_70 codificador_pt2262_tb.DUT.n_71 codificador_pt2262_tb.DUT.n_72 codificador_pt2262_tb.DUT.n_73 codificador_pt2262_tb.DUT.n_75 codificador_pt2262_tb.DUT.n_76 codificador_pt2262_tb.DUT.n_77 codificador_pt2262_tb.DUT.n_78 codificador_pt2262_tb.DUT.n_79 codificador_pt2262_tb.DUT.n_80 codificador_pt2262_tb.DUT.n_81 codificador_pt2262_tb.DUT.n_82 codificador_pt2262_tb.DUT.n_83 codificador_pt2262_tb.DUT.n_84 codificador_pt2262_tb.DUT.n_85 codificador_pt2262_tb.DUT.n_86 codificador_pt2262_tb.DUT.n_87 codificador_pt2262_tb.DUT.n_88 codificador_pt2262_tb.DUT.n_89 codificador_pt2262_tb.DUT.n_90 codificador_pt2262_tb.DUT.n_91 codificador_pt2262_tb.DUT.n_92 codificador_pt2262_tb.DUT.n_94 codificador_pt2262_tb.DUT.n_95 codificador_pt2262_tb.DUT.n_96 codificador_pt2262_tb.DUT.n_97 codificador_pt2262_tb.DUT.n_98 codificador_pt2262_tb.DUT.n_99 codificador_pt2262_tb.DUT.n_100 codificador_pt2262_tb.DUT.n_101 codificador_pt2262_tb.DUT.n_102 codificador_pt2262_tb.DUT.n_103 codificador_pt2262_tb.DUT.n_104 codificador_pt2262_tb.DUT.n_105 codificador_pt2262_tb.DUT.n_106 codificador_pt2262_tb.DUT.n_107 codificador_pt2262_tb.DUT.n_108 codificador_pt2262_tb.DUT.n_109 codificador_pt2262_tb.DUT.n_110 codificador_pt2262_tb.DUT.n_111 codificador_pt2262_tb.DUT.n_115 codificador_pt2262_tb.DUT.n_116 codificador_pt2262_tb.DUT.n_117 codificador_pt2262_tb.DUT.n_118 codificador_pt2262_tb.DUT.n_119 codificador_pt2262_tb.DUT.n_121 codificador_pt2262_tb.DUT.n_122 codificador_pt2262_tb.DUT.n_123 codificador_pt2262_tb.DUT.n_124 codificador_pt2262_tb.DUT.n_125 codificador_pt2262_tb.DUT.n_126 codificador_pt2262_tb.DUT.n_127 codificador_pt2262_tb.DUT.n_128 codificador_pt2262_tb.DUT.n_129 codificador_pt2262_tb.DUT.n_130 codificador_pt2262_tb.DUT.n_131 codificador_pt2262_tb.DUT.n_132 codificador_pt2262_tb.DUT.n_133 codificador_pt2262_tb.DUT.n_134 codificador_pt2262_tb.DUT.n_135 codificador_pt2262_tb.DUT.n_136 codificador_pt2262_tb.DUT.n_137 codificador_pt2262_tb.DUT.n_138 codificador_pt2262_tb.DUT.n_139 codificador_pt2262_tb.DUT.n_140 codificador_pt2262_tb.DUT.n_142 codificador_pt2262_tb.DUT.n_143 codificador_pt2262_tb.DUT.n_144 codificador_pt2262_tb.DUT.n_145 codificador_pt2262_tb.DUT.n_146 codificador_pt2262_tb.DUT.n_147 codificador_pt2262_tb.DUT.n_148 codificador_pt2262_tb.DUT.n_150 codificador_pt2262_tb.DUT.n_151 codificador_pt2262_tb.DUT.n_152 codificador_pt2262_tb.DUT.n_154 codificador_pt2262_tb.DUT.n_156 codificador_pt2262_tb.DUT.n_158 codificador_pt2262_tb.DUT.n_160 codificador_pt2262_tb.DUT.n_161 codificador_pt2262_tb.DUT.n_162 codificador_pt2262_tb.DUT.n_163 codificador_pt2262_tb.DUT.n_165 codificador_pt2262_tb.DUT.n_166 codificador_pt2262_tb.DUT.n_167 codificador_pt2262_tb.DUT.n_168 codificador_pt2262_tb.DUT.n_169 codificador_pt2262_tb.DUT.n_170 codificador_pt2262_tb.DUT.n_171 codificador_pt2262_tb.DUT.n_172 codificador_pt2262_tb.DUT.n_173 codificador_pt2262_tb.DUT.n_174 codificador_pt2262_tb.DUT.n_175 codificador_pt2262_tb.DUT.n_176 codificador_pt2262_tb.DUT.n_177 codificador_pt2262_tb.DUT.n_178 codificador_pt2262_tb.DUT.n_179 codificador_pt2262_tb.DUT.n_180 codificador_pt2262_tb.DUT.n_181 codificador_pt2262_tb.DUT.n_182 codificador_pt2262_tb.DUT.n_203 codificador_pt2262_tb.DUT.osc_clk codificador_pt2262_tb.DUT.past_osc_clk codificador_pt2262_tb.DUT.reset codificador_pt2262_tb.DUT.signal_creator_current_state codificador_pt2262_tb.DUT.signal_creator_enable_pulse_counting codificador_pt2262_tb.DUT.signal_creator_enable_pulse_counting_sync codificador_pt2262_tb.DUT.signal_creator_is_first_run codificador_pt2262_tb.DUT.signal_creator_pulse_counter codificador_pt2262_tb.DUT.signal_creator_pulse_counter_sync codificador_pt2262_tb.DUT.sync
Created probe 1
xcelium> probe -create -database waves BIT_GENERATOR.bit_sent BIT_GENERATOR.current_state BIT_GENERATOR.enable_generation BIT_GENERATOR.enable_pulse_counting BIT_GENERATOR.enable_pulse_counting_sync BIT_GENERATOR.input_bit BIT_GENERATOR.is_first_run BIT_GENERATOR.next_state BIT_GENERATOR.osc_clk BIT_GENERATOR.output_signal BIT_GENERATOR.pulse_counter BIT_GENERATOR.pulse_counter_sync BIT_GENERATOR.rst
Created probe 2
xcelium> probe -create -database waves CLOCK_DIVIDER.INPUT_CLK CLOCK_DIVIDER.OUTPUT_CLK CLOCK_DIVIDER.RST CLOCK_DIVIDER.clk_cycle_counting CLOCK_DIVIDER.divider_index_ceil
Created probe 3
xcelium> 
xcelium> simvision -input restore_enc_synth.tcl.svcf
xcelium> run
Simulation complete via $finish(1) at time 82542075 NS + 3
./encoder/codificador_pt2262_tb.sv:54         $finish;
xcelium> reset
Loaded snapshot worklib.codificador_pt2262_tb:sv
xcelium> run
Simulation complete via $finish(1) at time 82542075 NS + 3
./encoder/codificador_pt2262_tb.sv:54         $finish;
xcelium> ^C
xcelium> exit
TOOL:	xrun(64)	24.09-s001: Exiting on Jan 10, 2025 at 12:29:21 -03  (total: 00:03:28)
