xrun(64): 24.09-s001: (c) Copyright 1995-2024 Cadence Design Systems, Inc.
TOOL:	xrun(64)	24.09-s001: Started on Jan 09, 2025 at 16:32:04 -03
xrun
	-64bit
	/home/cinovador/Documents/course_files/digital_logic/verilog_files/PT2262-PT2272-enc_dec/decoder/decodificador_pt2272_tb.sv
	/home/cinovador/Documents/course_files/digital_logic/verilog_files/PT2262-PT2272-enc_dec/decoder/decodificador_pt2272.sv
	/home/cinovador/Documents/course_files/digital_logic/verilog_files/PT2262-PT2272-enc_dec/encoder/codificador_pt2262.sv
	/home/cinovador/Documents/course_files/digital_logic/verilog_files/PT2262-PT2272-enc_dec/addr_interpreter/addr_interpreter.sv
	/home/cinovador/Documents/course_files/digital_logic/verilog_files/PT2262-PT2272-enc_dec/addr_interpreter/comp_endereco.sv
	/home/cinovador/Documents/course_files/digital_logic/verilog_files/PT2262-PT2272-enc_dec/bit_gen/bit_generator.sv
	/home/cinovador/Documents/course_files/digital_logic/verilog_files/PT2262-PT2272-enc_dec/oscillator/clock_divider.sv
	/home/cinovador/Documents/course_files/digital_logic/verilog_files/PT2262-PT2272-enc_dec/bidir_shift_register/bidir_shiftreg.sv
	+access+rw
	+gui
	-s
Recompiling... reason: file './decoder/decodificador_pt2272.sv' is newer than expected.
	expected: Thu Jan  9 14:27:07 2025
	actual:   Thu Jan  9 16:31:57 2025
file: /home/cinovador/Documents/course_files/digital_logic/verilog_files/PT2262-PT2272-enc_dec/decoder/decodificador_pt2272.sv
	module worklib.decodificador_pt2272:sv
		errors: 0, warnings: 0
		Caching library 'worklib' ....... Done
	Elaborating the design hierarchy:
	Top level design units:
		decodificador_pt2272_tb
	Building instance overlay tables: .................... Done
	Generating native compiled code:
		worklib.decodificador_pt2272:sv <0x0b59ec19>
			streams:  64, words: 27457
	Building instance specific data structures.
	Loading native compiled code:     .................... Done
	Design hierarchy summary:
		                 Instances  Unique
		Modules:                11       8
		Registers:              87      79
		Scalar wires:           39       -
		Vectored wires:         29       -
		Always blocks:          20      18
		Initial blocks:          2       2
		Cont. assignments:       9      10
		Pseudo assignments:     35       -
		Process Clocks:         11       9
		Simulation timescale:  1ps
	Writing initial simulation snapshot: worklib.decodificador_pt2272_tb:sv
xmsim: *W,NOMTDGUI: Multi-Threaded Dumping is disabled for interactive debug mode.
xcelium> 
xcelium> source /home/tools/cadence/installs/XCELIUM2209/tools/xcelium/files/xmsimrc
xcelium> 
-------------------------------------
Relinquished control to SimVision...
# Restoring simulation environment...
xcelium> input {restore_dec.tcl}
xcelium> 
xcelium> # XM-Sim Command File
xcelium> # TOOL:	xmsim(64)	24.09-s001
xcelium> #
xcelium> #
xcelium> # You can restore this configuration with:
xcelium> #
xcelium> #      xrun -64bit /home/cinovador/Documents/course_files/digital_logic/verilog_files/PT2262-PT2272-enc_dec/decoder/decodificador_pt2272_tb.sv /home/cinovador/Documents/course_files/digital_logic/verilog_files/PT2262-PT2272-enc_dec/decoder/decodificador_pt2272.sv /home/cinovador/Documents/course_files/digital_logic/verilog_files/PT2262-PT2272-enc_dec/encoder/codificador_pt2262.sv /home/cinovador/Documents/course_files/digital_logic/verilog_files/PT2262-PT2272-enc_dec/addr_interpreter/addr_interpreter.sv /home/cinovador/Documents/course_files/digital_logic/verilog_files/PT2262-PT2272-enc_dec/addr_interpreter/comp_endereco.sv /home/cinovador/Documents/course_files/digital_logic/verilog_files/PT2262-PT2272-enc_dec/bit_gen/bit_generator.sv /home/cinovador/Documents/course_files/digital_logic/verilog_files/PT2262-PT2272-enc_dec/oscillator/clock_divider.sv /home/cinovador/Documents/course_files/digital_logic/verilog_files/PT2262-PT2272-enc_dec/bidir_shift_register/bidir_shiftreg.sv +access+rw +gui -s -input /home/cinovador/Documents/course_files/digital_logic/verilog_files/PT2262-PT2272-enc_dec/restore_dec.tcl
xcelium> #
xcelium> 
xcelium> set tcl_prompt1 {puts -nonewline "xcelium> "}
puts -nonewline "xcelium> "
xcelium> set tcl_prompt2 {puts -nonewline "> "}
puts -nonewline "> "
xcelium> set vlog_format %h
%h
xcelium> set vhdl_format %v
%v
xcelium> set real_precision 6
6
xcelium> set display_unit auto
auto
xcelium> set time_unit module
module
xcelium> set heap_garbage_size -200
-200
xcelium> set heap_garbage_time 0
0
xcelium> set assert_report_level note
note
xcelium> set assert_stop_level error
error
xcelium> set autoscope yes
yes
xcelium> set assert_1164_warnings yes
yes
xcelium> set pack_assert_off {}
xcelium> set severity_pack_assert_off {note warning}
note warning
xcelium> set assert_output_stop_level failed
failed
xcelium> set tcl_debug_level 0
0
xcelium> set relax_path_name 1
1
xcelium> set vhdl_vcdmap XX01ZX01X
XX01ZX01X
xcelium> set intovf_severity_level ERROR
ERROR
xcelium> set probe_screen_format 0
0
xcelium> set rangecnst_severity_level ERROR
ERROR
xcelium> set textio_severity_level ERROR
ERROR
xcelium> set vital_timing_checks_on 1
1
xcelium> set vlog_code_show_force 0
0
xcelium> set assert_count_attempts 1
1
xcelium> set tcl_all64 false
false
xcelium> set tcl_runerror_exit false
false
xcelium> set assert_report_incompletes 0
0
xcelium> set show_force 1
1
xcelium> set force_reset_by_reinvoke 0
0
xcelium> set tcl_relaxed_literal 0
0
xcelium> set probe_exclude_patterns {}
xcelium> set probe_packed_limit 4k
4k
xcelium> set probe_unpacked_limit 16k
16k
xcelium> set assert_internal_msg no
no
xcelium> set svseed 1
1
xcelium> set assert_reporting_mode 0
0
xcelium> set vcd_compact_mode 0
0
xcelium> set vhdl_forgen_loopindex_enum_pos 0
0
xcelium> set xmreplay_dc_debug 0
0
xcelium> set tcl_runcmd_interrupt next_command
next_command
xcelium> set tcl_sigval_prefix {#}
#
xcelium> alias . run
xcelium> alias indago verisium
xcelium> alias quit exit
xcelium> database -open -shm -into waves.shm waves -default
Created default SHM database waves
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.A decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_ENABLER decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_LEFT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_OP_MODE decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PT2272_BIT_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_RIGHT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_SERIAL_IN decodificador_pt2272_tb.DUT.D decodificador_pt2272_tb.DUT.HIGH_PULSE_COUNTING decodificador_pt2272_tb.DUT.LOW_PULSE_COUNTING decodificador_pt2272_tb.DUT.PREVIOUS_cod_i decodificador_pt2272_tb.DUT.clk decodificador_pt2272_tb.DUT.cod_i decodificador_pt2272_tb.DUT.cod_i_FELL decodificador_pt2272_tb.DUT.cod_i_ROSE decodificador_pt2272_tb.DUT.current_state decodificador_pt2272_tb.DUT.dv decodificador_pt2272_tb.DUT.next_state decodificador_pt2272_tb.DUT.reset decodificador_pt2272_tb.DUT.reset_counters decodificador_pt2272_tb.encoder_dut.A decodificador_pt2272_tb.encoder_dut.D decodificador_pt2272_tb.encoder_dut.F_BIT_LOCATOR decodificador_pt2272_tb.encoder_dut.INTERPRETED_ADDR decodificador_pt2272_tb.encoder_dut.bit_gen_enb decodificador_pt2272_tb.encoder_dut.bit_gen_input decodificador_pt2272_tb.encoder_dut.bit_gen_output decodificador_pt2272_tb.encoder_dut.bit_gen_rst decodificador_pt2272_tb.encoder_dut.bit_generated_flag decodificador_pt2272_tb.encoder_dut.bit_sent_flag decodificador_pt2272_tb.encoder_dut.clk decodificador_pt2272_tb.encoder_dut.cod_o decodificador_pt2272_tb.encoder_dut.current_state decodificador_pt2272_tb.encoder_dut.next_state decodificador_pt2272_tb.encoder_dut.osc_clk decodificador_pt2272_tb.encoder_dut.osc_clk_rose decodificador_pt2272_tb.encoder_dut.osc_rst decodificador_pt2272_tb.encoder_dut.past_osc_clk decodificador_pt2272_tb.encoder_dut.reset decodificador_pt2272_tb.encoder_dut.sync
Created probe 1
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.osc_rst decodificador_pt2272_tb.DUT.osc_clk
Created probe 2
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.A decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_ENABLER decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_LEFT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_OP_MODE decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PT2272_BIT_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_RIGHT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_SERIAL_IN decodificador_pt2272_tb.DUT.D decodificador_pt2272_tb.DUT.HIGH_PULSE_COUNTING decodificador_pt2272_tb.DUT.LOW_PULSE_COUNTING decodificador_pt2272_tb.DUT.PREVIOUS_cod_i decodificador_pt2272_tb.DUT.clk decodificador_pt2272_tb.DUT.cod_i decodificador_pt2272_tb.DUT.cod_i_FELL decodificador_pt2272_tb.DUT.cod_i_ROSE decodificador_pt2272_tb.DUT.current_state decodificador_pt2272_tb.DUT.dv decodificador_pt2272_tb.DUT.next_state decodificador_pt2272_tb.DUT.reset decodificador_pt2272_tb.DUT.reset_counters decodificador_pt2272_tb.encoder_dut.A decodificador_pt2272_tb.encoder_dut.D decodificador_pt2272_tb.encoder_dut.F_BIT_LOCATOR decodificador_pt2272_tb.encoder_dut.INTERPRETED_ADDR decodificador_pt2272_tb.encoder_dut.bit_gen_enb decodificador_pt2272_tb.encoder_dut.bit_gen_input decodificador_pt2272_tb.encoder_dut.bit_gen_output decodificador_pt2272_tb.encoder_dut.bit_gen_rst decodificador_pt2272_tb.encoder_dut.bit_generated_flag decodificador_pt2272_tb.encoder_dut.bit_sent_flag decodificador_pt2272_tb.encoder_dut.clk decodificador_pt2272_tb.encoder_dut.cod_o decodificador_pt2272_tb.encoder_dut.current_state decodificador_pt2272_tb.encoder_dut.next_state decodificador_pt2272_tb.encoder_dut.osc_clk decodificador_pt2272_tb.encoder_dut.osc_clk_rose decodificador_pt2272_tb.encoder_dut.osc_rst decodificador_pt2272_tb.encoder_dut.past_osc_clk decodificador_pt2272_tb.encoder_dut.reset decodificador_pt2272_tb.encoder_dut.sync
Created probe 3
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.osc_rst decodificador_pt2272_tb.DUT.osc_clk
Created probe 4
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.A decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_ENABLER decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_LEFT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_OP_MODE decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PT2272_BIT_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_RIGHT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_SERIAL_IN decodificador_pt2272_tb.DUT.D decodificador_pt2272_tb.DUT.HIGH_PULSE_COUNTING decodificador_pt2272_tb.DUT.LOW_PULSE_COUNTING decodificador_pt2272_tb.DUT.PREVIOUS_cod_i decodificador_pt2272_tb.DUT.clk decodificador_pt2272_tb.DUT.cod_i decodificador_pt2272_tb.DUT.cod_i_FELL decodificador_pt2272_tb.DUT.cod_i_ROSE decodificador_pt2272_tb.DUT.current_state decodificador_pt2272_tb.DUT.dv decodificador_pt2272_tb.DUT.next_state decodificador_pt2272_tb.DUT.reset decodificador_pt2272_tb.DUT.reset_counters decodificador_pt2272_tb.encoder_dut.A decodificador_pt2272_tb.encoder_dut.D decodificador_pt2272_tb.encoder_dut.F_BIT_LOCATOR decodificador_pt2272_tb.encoder_dut.INTERPRETED_ADDR decodificador_pt2272_tb.encoder_dut.bit_gen_enb decodificador_pt2272_tb.encoder_dut.bit_gen_input decodificador_pt2272_tb.encoder_dut.bit_gen_output decodificador_pt2272_tb.encoder_dut.bit_gen_rst decodificador_pt2272_tb.encoder_dut.bit_generated_flag decodificador_pt2272_tb.encoder_dut.bit_sent_flag decodificador_pt2272_tb.encoder_dut.clk decodificador_pt2272_tb.encoder_dut.cod_o decodificador_pt2272_tb.encoder_dut.current_state decodificador_pt2272_tb.encoder_dut.next_state decodificador_pt2272_tb.encoder_dut.osc_clk decodificador_pt2272_tb.encoder_dut.osc_clk_rose decodificador_pt2272_tb.encoder_dut.osc_rst decodificador_pt2272_tb.encoder_dut.past_osc_clk decodificador_pt2272_tb.encoder_dut.reset decodificador_pt2272_tb.encoder_dut.sync
Created probe 5
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.osc_rst decodificador_pt2272_tb.DUT.osc_clk
Created probe 6
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.A decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_ENABLER decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_LEFT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_OP_MODE decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PT2272_BIT_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_RIGHT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_SERIAL_IN decodificador_pt2272_tb.DUT.D decodificador_pt2272_tb.DUT.HIGH_PULSE_COUNTING decodificador_pt2272_tb.DUT.LOW_PULSE_COUNTING decodificador_pt2272_tb.DUT.PREVIOUS_cod_i decodificador_pt2272_tb.DUT.clk decodificador_pt2272_tb.DUT.cod_i decodificador_pt2272_tb.DUT.cod_i_FELL decodificador_pt2272_tb.DUT.cod_i_ROSE decodificador_pt2272_tb.DUT.current_state decodificador_pt2272_tb.DUT.dv decodificador_pt2272_tb.DUT.next_state decodificador_pt2272_tb.DUT.reset decodificador_pt2272_tb.DUT.reset_counters decodificador_pt2272_tb.encoder_dut.A decodificador_pt2272_tb.encoder_dut.D decodificador_pt2272_tb.encoder_dut.F_BIT_LOCATOR decodificador_pt2272_tb.encoder_dut.INTERPRETED_ADDR decodificador_pt2272_tb.encoder_dut.bit_gen_enb decodificador_pt2272_tb.encoder_dut.bit_gen_input decodificador_pt2272_tb.encoder_dut.bit_gen_output decodificador_pt2272_tb.encoder_dut.bit_gen_rst decodificador_pt2272_tb.encoder_dut.bit_generated_flag decodificador_pt2272_tb.encoder_dut.bit_sent_flag decodificador_pt2272_tb.encoder_dut.clk decodificador_pt2272_tb.encoder_dut.cod_o decodificador_pt2272_tb.encoder_dut.current_state decodificador_pt2272_tb.encoder_dut.next_state decodificador_pt2272_tb.encoder_dut.osc_clk decodificador_pt2272_tb.encoder_dut.osc_clk_rose decodificador_pt2272_tb.encoder_dut.osc_rst decodificador_pt2272_tb.encoder_dut.past_osc_clk decodificador_pt2272_tb.encoder_dut.reset decodificador_pt2272_tb.encoder_dut.sync
Created probe 7
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.osc_rst decodificador_pt2272_tb.DUT.osc_clk
Created probe 8
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.A decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_ENABLER decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_LEFT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_OP_MODE decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PT2272_BIT_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_RIGHT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_SERIAL_IN decodificador_pt2272_tb.DUT.D decodificador_pt2272_tb.DUT.HIGH_PULSE_COUNTING decodificador_pt2272_tb.DUT.LOW_PULSE_COUNTING decodificador_pt2272_tb.DUT.PREVIOUS_cod_i decodificador_pt2272_tb.DUT.clk decodificador_pt2272_tb.DUT.cod_i decodificador_pt2272_tb.DUT.cod_i_FELL decodificador_pt2272_tb.DUT.cod_i_ROSE decodificador_pt2272_tb.DUT.current_state decodificador_pt2272_tb.DUT.dv decodificador_pt2272_tb.DUT.next_state decodificador_pt2272_tb.DUT.reset decodificador_pt2272_tb.DUT.reset_counters decodificador_pt2272_tb.encoder_dut.A decodificador_pt2272_tb.encoder_dut.D decodificador_pt2272_tb.encoder_dut.F_BIT_LOCATOR decodificador_pt2272_tb.encoder_dut.INTERPRETED_ADDR decodificador_pt2272_tb.encoder_dut.bit_gen_enb decodificador_pt2272_tb.encoder_dut.bit_gen_input decodificador_pt2272_tb.encoder_dut.bit_gen_output decodificador_pt2272_tb.encoder_dut.bit_gen_rst decodificador_pt2272_tb.encoder_dut.bit_generated_flag decodificador_pt2272_tb.encoder_dut.bit_sent_flag decodificador_pt2272_tb.encoder_dut.clk decodificador_pt2272_tb.encoder_dut.cod_o decodificador_pt2272_tb.encoder_dut.current_state decodificador_pt2272_tb.encoder_dut.next_state decodificador_pt2272_tb.encoder_dut.osc_clk decodificador_pt2272_tb.encoder_dut.osc_clk_rose decodificador_pt2272_tb.encoder_dut.osc_rst decodificador_pt2272_tb.encoder_dut.past_osc_clk decodificador_pt2272_tb.encoder_dut.reset decodificador_pt2272_tb.encoder_dut.sync
Created probe 9
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.osc_rst decodificador_pt2272_tb.DUT.osc_clk
Created probe 10
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.A decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_ENABLER decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_LEFT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_OP_MODE decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PT2272_BIT_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_RIGHT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_SERIAL_IN decodificador_pt2272_tb.DUT.D decodificador_pt2272_tb.DUT.HIGH_PULSE_COUNTING decodificador_pt2272_tb.DUT.LOW_PULSE_COUNTING decodificador_pt2272_tb.DUT.PREVIOUS_cod_i decodificador_pt2272_tb.DUT.clk decodificador_pt2272_tb.DUT.cod_i decodificador_pt2272_tb.DUT.cod_i_FELL decodificador_pt2272_tb.DUT.cod_i_ROSE decodificador_pt2272_tb.DUT.current_state decodificador_pt2272_tb.DUT.dv decodificador_pt2272_tb.DUT.next_state decodificador_pt2272_tb.DUT.reset decodificador_pt2272_tb.DUT.reset_counters decodificador_pt2272_tb.encoder_dut.A decodificador_pt2272_tb.encoder_dut.D decodificador_pt2272_tb.encoder_dut.F_BIT_LOCATOR decodificador_pt2272_tb.encoder_dut.INTERPRETED_ADDR decodificador_pt2272_tb.encoder_dut.bit_gen_enb decodificador_pt2272_tb.encoder_dut.bit_gen_input decodificador_pt2272_tb.encoder_dut.bit_gen_output decodificador_pt2272_tb.encoder_dut.bit_gen_rst decodificador_pt2272_tb.encoder_dut.bit_generated_flag decodificador_pt2272_tb.encoder_dut.bit_sent_flag decodificador_pt2272_tb.encoder_dut.clk decodificador_pt2272_tb.encoder_dut.cod_o decodificador_pt2272_tb.encoder_dut.current_state decodificador_pt2272_tb.encoder_dut.next_state decodificador_pt2272_tb.encoder_dut.osc_clk decodificador_pt2272_tb.encoder_dut.osc_clk_rose decodificador_pt2272_tb.encoder_dut.osc_rst decodificador_pt2272_tb.encoder_dut.past_osc_clk decodificador_pt2272_tb.encoder_dut.reset decodificador_pt2272_tb.encoder_dut.sync
Created probe 11
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.osc_rst decodificador_pt2272_tb.DUT.osc_clk
Created probe 12
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.A decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_ENABLER decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_LEFT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_OP_MODE decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PT2272_BIT_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_RIGHT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_SERIAL_IN decodificador_pt2272_tb.DUT.D decodificador_pt2272_tb.DUT.HIGH_PULSE_COUNTING decodificador_pt2272_tb.DUT.LOW_PULSE_COUNTING decodificador_pt2272_tb.DUT.PREVIOUS_cod_i decodificador_pt2272_tb.DUT.clk decodificador_pt2272_tb.DUT.cod_i decodificador_pt2272_tb.DUT.cod_i_FELL decodificador_pt2272_tb.DUT.cod_i_ROSE decodificador_pt2272_tb.DUT.current_state decodificador_pt2272_tb.DUT.dv decodificador_pt2272_tb.DUT.next_state decodificador_pt2272_tb.DUT.reset decodificador_pt2272_tb.DUT.reset_counters decodificador_pt2272_tb.encoder_dut.A decodificador_pt2272_tb.encoder_dut.D decodificador_pt2272_tb.encoder_dut.F_BIT_LOCATOR decodificador_pt2272_tb.encoder_dut.INTERPRETED_ADDR decodificador_pt2272_tb.encoder_dut.bit_gen_enb decodificador_pt2272_tb.encoder_dut.bit_gen_input decodificador_pt2272_tb.encoder_dut.bit_gen_output decodificador_pt2272_tb.encoder_dut.bit_gen_rst decodificador_pt2272_tb.encoder_dut.bit_generated_flag decodificador_pt2272_tb.encoder_dut.bit_sent_flag decodificador_pt2272_tb.encoder_dut.clk decodificador_pt2272_tb.encoder_dut.cod_o decodificador_pt2272_tb.encoder_dut.current_state decodificador_pt2272_tb.encoder_dut.next_state decodificador_pt2272_tb.encoder_dut.osc_clk decodificador_pt2272_tb.encoder_dut.osc_clk_rose decodificador_pt2272_tb.encoder_dut.osc_rst decodificador_pt2272_tb.encoder_dut.past_osc_clk decodificador_pt2272_tb.encoder_dut.reset decodificador_pt2272_tb.encoder_dut.sync
Created probe 13
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.osc_rst decodificador_pt2272_tb.DUT.osc_clk
Created probe 14
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.A decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_ENABLER decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_LEFT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_OP_MODE decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PT2272_BIT_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_RIGHT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_SERIAL_IN decodificador_pt2272_tb.DUT.D decodificador_pt2272_tb.DUT.HIGH_PULSE_COUNTING decodificador_pt2272_tb.DUT.LOW_PULSE_COUNTING decodificador_pt2272_tb.DUT.PREVIOUS_cod_i decodificador_pt2272_tb.DUT.clk decodificador_pt2272_tb.DUT.cod_i decodificador_pt2272_tb.DUT.cod_i_FELL decodificador_pt2272_tb.DUT.cod_i_ROSE decodificador_pt2272_tb.DUT.current_state decodificador_pt2272_tb.DUT.dv decodificador_pt2272_tb.DUT.next_state decodificador_pt2272_tb.DUT.reset decodificador_pt2272_tb.DUT.reset_counters decodificador_pt2272_tb.encoder_dut.A decodificador_pt2272_tb.encoder_dut.D decodificador_pt2272_tb.encoder_dut.F_BIT_LOCATOR decodificador_pt2272_tb.encoder_dut.INTERPRETED_ADDR decodificador_pt2272_tb.encoder_dut.bit_gen_enb decodificador_pt2272_tb.encoder_dut.bit_gen_input decodificador_pt2272_tb.encoder_dut.bit_gen_output decodificador_pt2272_tb.encoder_dut.bit_gen_rst decodificador_pt2272_tb.encoder_dut.bit_generated_flag decodificador_pt2272_tb.encoder_dut.bit_sent_flag decodificador_pt2272_tb.encoder_dut.clk decodificador_pt2272_tb.encoder_dut.cod_o decodificador_pt2272_tb.encoder_dut.current_state decodificador_pt2272_tb.encoder_dut.next_state decodificador_pt2272_tb.encoder_dut.osc_clk decodificador_pt2272_tb.encoder_dut.osc_clk_rose decodificador_pt2272_tb.encoder_dut.osc_rst decodificador_pt2272_tb.encoder_dut.past_osc_clk decodificador_pt2272_tb.encoder_dut.reset decodificador_pt2272_tb.encoder_dut.sync
Created probe 15
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.osc_rst decodificador_pt2272_tb.DUT.osc_clk
Created probe 16
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.A decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_ENABLER decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_LEFT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_OP_MODE decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PT2272_BIT_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_RIGHT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_SERIAL_IN decodificador_pt2272_tb.DUT.D decodificador_pt2272_tb.DUT.HIGH_PULSE_COUNTING decodificador_pt2272_tb.DUT.LOW_PULSE_COUNTING decodificador_pt2272_tb.DUT.PREVIOUS_cod_i decodificador_pt2272_tb.DUT.clk decodificador_pt2272_tb.DUT.cod_i decodificador_pt2272_tb.DUT.cod_i_FELL decodificador_pt2272_tb.DUT.cod_i_ROSE decodificador_pt2272_tb.DUT.current_state decodificador_pt2272_tb.DUT.dv decodificador_pt2272_tb.DUT.next_state decodificador_pt2272_tb.DUT.reset decodificador_pt2272_tb.DUT.reset_counters decodificador_pt2272_tb.encoder_dut.A decodificador_pt2272_tb.encoder_dut.D decodificador_pt2272_tb.encoder_dut.F_BIT_LOCATOR decodificador_pt2272_tb.encoder_dut.INTERPRETED_ADDR decodificador_pt2272_tb.encoder_dut.bit_gen_enb decodificador_pt2272_tb.encoder_dut.bit_gen_input decodificador_pt2272_tb.encoder_dut.bit_gen_output decodificador_pt2272_tb.encoder_dut.bit_gen_rst decodificador_pt2272_tb.encoder_dut.bit_generated_flag decodificador_pt2272_tb.encoder_dut.bit_sent_flag decodificador_pt2272_tb.encoder_dut.clk decodificador_pt2272_tb.encoder_dut.cod_o decodificador_pt2272_tb.encoder_dut.current_state decodificador_pt2272_tb.encoder_dut.next_state decodificador_pt2272_tb.encoder_dut.osc_clk decodificador_pt2272_tb.encoder_dut.osc_clk_rose decodificador_pt2272_tb.encoder_dut.osc_rst decodificador_pt2272_tb.encoder_dut.past_osc_clk decodificador_pt2272_tb.encoder_dut.reset decodificador_pt2272_tb.encoder_dut.sync
Created probe 17
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.osc_rst decodificador_pt2272_tb.DUT.osc_clk
Created probe 18
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.A decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_ENABLER decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_LEFT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_OP_MODE decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PT2272_BIT_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_RIGHT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_SERIAL_IN decodificador_pt2272_tb.DUT.D decodificador_pt2272_tb.DUT.HIGH_PULSE_COUNTING decodificador_pt2272_tb.DUT.LOW_PULSE_COUNTING decodificador_pt2272_tb.DUT.PREVIOUS_cod_i decodificador_pt2272_tb.DUT.clk decodificador_pt2272_tb.DUT.cod_i decodificador_pt2272_tb.DUT.cod_i_FELL decodificador_pt2272_tb.DUT.cod_i_ROSE decodificador_pt2272_tb.DUT.current_state decodificador_pt2272_tb.DUT.dv decodificador_pt2272_tb.DUT.next_state decodificador_pt2272_tb.DUT.reset decodificador_pt2272_tb.DUT.reset_counters decodificador_pt2272_tb.encoder_dut.A decodificador_pt2272_tb.encoder_dut.D decodificador_pt2272_tb.encoder_dut.F_BIT_LOCATOR decodificador_pt2272_tb.encoder_dut.INTERPRETED_ADDR decodificador_pt2272_tb.encoder_dut.bit_gen_enb decodificador_pt2272_tb.encoder_dut.bit_gen_input decodificador_pt2272_tb.encoder_dut.bit_gen_output decodificador_pt2272_tb.encoder_dut.bit_gen_rst decodificador_pt2272_tb.encoder_dut.bit_generated_flag decodificador_pt2272_tb.encoder_dut.bit_sent_flag decodificador_pt2272_tb.encoder_dut.clk decodificador_pt2272_tb.encoder_dut.cod_o decodificador_pt2272_tb.encoder_dut.current_state decodificador_pt2272_tb.encoder_dut.next_state decodificador_pt2272_tb.encoder_dut.osc_clk decodificador_pt2272_tb.encoder_dut.osc_clk_rose decodificador_pt2272_tb.encoder_dut.osc_rst decodificador_pt2272_tb.encoder_dut.past_osc_clk decodificador_pt2272_tb.encoder_dut.reset decodificador_pt2272_tb.encoder_dut.sync
Created probe 19
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.osc_rst decodificador_pt2272_tb.DUT.osc_clk
Created probe 20
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.A decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_ENABLER decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_LEFT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_OP_MODE decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PT2272_BIT_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_RIGHT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_SERIAL_IN decodificador_pt2272_tb.DUT.D decodificador_pt2272_tb.DUT.HIGH_PULSE_COUNTING decodificador_pt2272_tb.DUT.LOW_PULSE_COUNTING decodificador_pt2272_tb.DUT.PREVIOUS_cod_i decodificador_pt2272_tb.DUT.clk decodificador_pt2272_tb.DUT.cod_i decodificador_pt2272_tb.DUT.cod_i_FELL decodificador_pt2272_tb.DUT.cod_i_ROSE decodificador_pt2272_tb.DUT.current_state decodificador_pt2272_tb.DUT.dv decodificador_pt2272_tb.DUT.next_state decodificador_pt2272_tb.DUT.reset decodificador_pt2272_tb.DUT.reset_counters decodificador_pt2272_tb.encoder_dut.A decodificador_pt2272_tb.encoder_dut.D decodificador_pt2272_tb.encoder_dut.F_BIT_LOCATOR decodificador_pt2272_tb.encoder_dut.INTERPRETED_ADDR decodificador_pt2272_tb.encoder_dut.bit_gen_enb decodificador_pt2272_tb.encoder_dut.bit_gen_input decodificador_pt2272_tb.encoder_dut.bit_gen_output decodificador_pt2272_tb.encoder_dut.bit_gen_rst decodificador_pt2272_tb.encoder_dut.bit_generated_flag decodificador_pt2272_tb.encoder_dut.bit_sent_flag decodificador_pt2272_tb.encoder_dut.clk decodificador_pt2272_tb.encoder_dut.cod_o decodificador_pt2272_tb.encoder_dut.current_state decodificador_pt2272_tb.encoder_dut.next_state decodificador_pt2272_tb.encoder_dut.osc_clk decodificador_pt2272_tb.encoder_dut.osc_clk_rose decodificador_pt2272_tb.encoder_dut.osc_rst decodificador_pt2272_tb.encoder_dut.past_osc_clk decodificador_pt2272_tb.encoder_dut.reset decodificador_pt2272_tb.encoder_dut.sync
Created probe 21
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.osc_rst decodificador_pt2272_tb.DUT.osc_clk
Created probe 22
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.A decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_ENABLER decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_LEFT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_OP_MODE decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PT2272_BIT_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_RIGHT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_SERIAL_IN decodificador_pt2272_tb.DUT.D decodificador_pt2272_tb.DUT.HIGH_PULSE_COUNTING decodificador_pt2272_tb.DUT.LOW_PULSE_COUNTING decodificador_pt2272_tb.DUT.PREVIOUS_cod_i decodificador_pt2272_tb.DUT.clk decodificador_pt2272_tb.DUT.cod_i decodificador_pt2272_tb.DUT.cod_i_FELL decodificador_pt2272_tb.DUT.cod_i_ROSE decodificador_pt2272_tb.DUT.current_state decodificador_pt2272_tb.DUT.dv decodificador_pt2272_tb.DUT.next_state decodificador_pt2272_tb.DUT.reset decodificador_pt2272_tb.DUT.reset_counters decodificador_pt2272_tb.encoder_dut.A decodificador_pt2272_tb.encoder_dut.D decodificador_pt2272_tb.encoder_dut.F_BIT_LOCATOR decodificador_pt2272_tb.encoder_dut.INTERPRETED_ADDR decodificador_pt2272_tb.encoder_dut.bit_gen_enb decodificador_pt2272_tb.encoder_dut.bit_gen_input decodificador_pt2272_tb.encoder_dut.bit_gen_output decodificador_pt2272_tb.encoder_dut.bit_gen_rst decodificador_pt2272_tb.encoder_dut.bit_generated_flag decodificador_pt2272_tb.encoder_dut.bit_sent_flag decodificador_pt2272_tb.encoder_dut.clk decodificador_pt2272_tb.encoder_dut.cod_o decodificador_pt2272_tb.encoder_dut.current_state decodificador_pt2272_tb.encoder_dut.next_state decodificador_pt2272_tb.encoder_dut.osc_clk decodificador_pt2272_tb.encoder_dut.osc_clk_rose decodificador_pt2272_tb.encoder_dut.osc_rst decodificador_pt2272_tb.encoder_dut.past_osc_clk decodificador_pt2272_tb.encoder_dut.reset decodificador_pt2272_tb.encoder_dut.sync
Created probe 23
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.osc_rst decodificador_pt2272_tb.DUT.osc_clk
Created probe 24
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.A decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_ENABLER decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_LEFT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_OP_MODE decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PT2272_BIT_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_RIGHT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_SERIAL_IN decodificador_pt2272_tb.DUT.D decodificador_pt2272_tb.DUT.HIGH_PULSE_COUNTING decodificador_pt2272_tb.DUT.LOW_PULSE_COUNTING decodificador_pt2272_tb.DUT.PREVIOUS_cod_i decodificador_pt2272_tb.DUT.clk decodificador_pt2272_tb.DUT.cod_i decodificador_pt2272_tb.DUT.cod_i_FELL decodificador_pt2272_tb.DUT.cod_i_ROSE decodificador_pt2272_tb.DUT.current_state decodificador_pt2272_tb.DUT.dv decodificador_pt2272_tb.DUT.next_state decodificador_pt2272_tb.DUT.reset decodificador_pt2272_tb.DUT.reset_counters decodificador_pt2272_tb.encoder_dut.A decodificador_pt2272_tb.encoder_dut.D decodificador_pt2272_tb.encoder_dut.F_BIT_LOCATOR decodificador_pt2272_tb.encoder_dut.INTERPRETED_ADDR decodificador_pt2272_tb.encoder_dut.bit_gen_enb decodificador_pt2272_tb.encoder_dut.bit_gen_input decodificador_pt2272_tb.encoder_dut.bit_gen_output decodificador_pt2272_tb.encoder_dut.bit_gen_rst decodificador_pt2272_tb.encoder_dut.bit_generated_flag decodificador_pt2272_tb.encoder_dut.bit_sent_flag decodificador_pt2272_tb.encoder_dut.clk decodificador_pt2272_tb.encoder_dut.cod_o decodificador_pt2272_tb.encoder_dut.current_state decodificador_pt2272_tb.encoder_dut.next_state decodificador_pt2272_tb.encoder_dut.osc_clk decodificador_pt2272_tb.encoder_dut.osc_clk_rose decodificador_pt2272_tb.encoder_dut.osc_rst decodificador_pt2272_tb.encoder_dut.past_osc_clk decodificador_pt2272_tb.encoder_dut.reset decodificador_pt2272_tb.encoder_dut.sync
Created probe 25
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.osc_rst decodificador_pt2272_tb.DUT.osc_clk
Created probe 26
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.A decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_ENABLER decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_LEFT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_OP_MODE decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PT2272_BIT_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_RIGHT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_SERIAL_IN decodificador_pt2272_tb.DUT.D decodificador_pt2272_tb.DUT.HIGH_PULSE_COUNTING decodificador_pt2272_tb.DUT.LOW_PULSE_COUNTING decodificador_pt2272_tb.DUT.PREVIOUS_cod_i decodificador_pt2272_tb.DUT.clk decodificador_pt2272_tb.DUT.cod_i decodificador_pt2272_tb.DUT.cod_i_FELL decodificador_pt2272_tb.DUT.cod_i_ROSE decodificador_pt2272_tb.DUT.current_state decodificador_pt2272_tb.DUT.dv decodificador_pt2272_tb.DUT.next_state decodificador_pt2272_tb.DUT.reset decodificador_pt2272_tb.DUT.reset_counters decodificador_pt2272_tb.encoder_dut.A decodificador_pt2272_tb.encoder_dut.D decodificador_pt2272_tb.encoder_dut.F_BIT_LOCATOR decodificador_pt2272_tb.encoder_dut.INTERPRETED_ADDR decodificador_pt2272_tb.encoder_dut.bit_gen_enb decodificador_pt2272_tb.encoder_dut.bit_gen_input decodificador_pt2272_tb.encoder_dut.bit_gen_output decodificador_pt2272_tb.encoder_dut.bit_gen_rst decodificador_pt2272_tb.encoder_dut.bit_generated_flag decodificador_pt2272_tb.encoder_dut.bit_sent_flag decodificador_pt2272_tb.encoder_dut.clk decodificador_pt2272_tb.encoder_dut.cod_o decodificador_pt2272_tb.encoder_dut.current_state decodificador_pt2272_tb.encoder_dut.next_state decodificador_pt2272_tb.encoder_dut.osc_clk decodificador_pt2272_tb.encoder_dut.osc_clk_rose decodificador_pt2272_tb.encoder_dut.osc_rst decodificador_pt2272_tb.encoder_dut.past_osc_clk decodificador_pt2272_tb.encoder_dut.reset decodificador_pt2272_tb.encoder_dut.sync
Created probe 27
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.osc_rst decodificador_pt2272_tb.DUT.osc_clk
Created probe 28
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.A decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_ENABLER decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_LEFT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_OP_MODE decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PT2272_BIT_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_RIGHT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_SERIAL_IN decodificador_pt2272_tb.DUT.D decodificador_pt2272_tb.DUT.HIGH_PULSE_COUNTING decodificador_pt2272_tb.DUT.LOW_PULSE_COUNTING decodificador_pt2272_tb.DUT.PREVIOUS_cod_i decodificador_pt2272_tb.DUT.clk decodificador_pt2272_tb.DUT.cod_i decodificador_pt2272_tb.DUT.cod_i_FELL decodificador_pt2272_tb.DUT.cod_i_ROSE decodificador_pt2272_tb.DUT.current_state decodificador_pt2272_tb.DUT.dv decodificador_pt2272_tb.DUT.next_state decodificador_pt2272_tb.DUT.reset decodificador_pt2272_tb.DUT.reset_counters decodificador_pt2272_tb.encoder_dut.A decodificador_pt2272_tb.encoder_dut.D decodificador_pt2272_tb.encoder_dut.F_BIT_LOCATOR decodificador_pt2272_tb.encoder_dut.INTERPRETED_ADDR decodificador_pt2272_tb.encoder_dut.bit_gen_enb decodificador_pt2272_tb.encoder_dut.bit_gen_input decodificador_pt2272_tb.encoder_dut.bit_gen_output decodificador_pt2272_tb.encoder_dut.bit_gen_rst decodificador_pt2272_tb.encoder_dut.bit_generated_flag decodificador_pt2272_tb.encoder_dut.bit_sent_flag decodificador_pt2272_tb.encoder_dut.clk decodificador_pt2272_tb.encoder_dut.cod_o decodificador_pt2272_tb.encoder_dut.current_state decodificador_pt2272_tb.encoder_dut.next_state decodificador_pt2272_tb.encoder_dut.osc_clk decodificador_pt2272_tb.encoder_dut.osc_clk_rose decodificador_pt2272_tb.encoder_dut.osc_rst decodificador_pt2272_tb.encoder_dut.past_osc_clk decodificador_pt2272_tb.encoder_dut.reset decodificador_pt2272_tb.encoder_dut.sync
Created probe 29
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.osc_rst decodificador_pt2272_tb.DUT.osc_clk
Created probe 30
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.A decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_ENABLER decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_LEFT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_OP_MODE decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PT2272_BIT_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_RIGHT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_SERIAL_IN decodificador_pt2272_tb.DUT.D decodificador_pt2272_tb.DUT.HIGH_PULSE_COUNTING decodificador_pt2272_tb.DUT.LOW_PULSE_COUNTING decodificador_pt2272_tb.DUT.PREVIOUS_cod_i decodificador_pt2272_tb.DUT.clk decodificador_pt2272_tb.DUT.cod_i decodificador_pt2272_tb.DUT.cod_i_FELL decodificador_pt2272_tb.DUT.cod_i_ROSE decodificador_pt2272_tb.DUT.current_state decodificador_pt2272_tb.DUT.dv decodificador_pt2272_tb.DUT.next_state decodificador_pt2272_tb.DUT.reset decodificador_pt2272_tb.DUT.reset_counters decodificador_pt2272_tb.encoder_dut.A decodificador_pt2272_tb.encoder_dut.D decodificador_pt2272_tb.encoder_dut.F_BIT_LOCATOR decodificador_pt2272_tb.encoder_dut.INTERPRETED_ADDR decodificador_pt2272_tb.encoder_dut.bit_gen_enb decodificador_pt2272_tb.encoder_dut.bit_gen_input decodificador_pt2272_tb.encoder_dut.bit_gen_output decodificador_pt2272_tb.encoder_dut.bit_gen_rst decodificador_pt2272_tb.encoder_dut.bit_generated_flag decodificador_pt2272_tb.encoder_dut.bit_sent_flag decodificador_pt2272_tb.encoder_dut.clk decodificador_pt2272_tb.encoder_dut.cod_o decodificador_pt2272_tb.encoder_dut.current_state decodificador_pt2272_tb.encoder_dut.next_state decodificador_pt2272_tb.encoder_dut.osc_clk decodificador_pt2272_tb.encoder_dut.osc_clk_rose decodificador_pt2272_tb.encoder_dut.osc_rst decodificador_pt2272_tb.encoder_dut.past_osc_clk decodificador_pt2272_tb.encoder_dut.reset decodificador_pt2272_tb.encoder_dut.sync
Created probe 31
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.osc_rst decodificador_pt2272_tb.DUT.osc_clk
Created probe 32
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.A decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_ENABLER decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_LEFT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_OP_MODE decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PT2272_BIT_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_RIGHT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_SERIAL_IN decodificador_pt2272_tb.DUT.D decodificador_pt2272_tb.DUT.HIGH_PULSE_COUNTING decodificador_pt2272_tb.DUT.LOW_PULSE_COUNTING decodificador_pt2272_tb.DUT.PREVIOUS_cod_i decodificador_pt2272_tb.DUT.clk decodificador_pt2272_tb.DUT.cod_i decodificador_pt2272_tb.DUT.cod_i_FELL decodificador_pt2272_tb.DUT.cod_i_ROSE decodificador_pt2272_tb.DUT.current_state decodificador_pt2272_tb.DUT.dv decodificador_pt2272_tb.DUT.next_state decodificador_pt2272_tb.DUT.reset decodificador_pt2272_tb.DUT.reset_counters decodificador_pt2272_tb.encoder_dut.A decodificador_pt2272_tb.encoder_dut.D decodificador_pt2272_tb.encoder_dut.F_BIT_LOCATOR decodificador_pt2272_tb.encoder_dut.INTERPRETED_ADDR decodificador_pt2272_tb.encoder_dut.bit_gen_enb decodificador_pt2272_tb.encoder_dut.bit_gen_input decodificador_pt2272_tb.encoder_dut.bit_gen_output decodificador_pt2272_tb.encoder_dut.bit_gen_rst decodificador_pt2272_tb.encoder_dut.bit_generated_flag decodificador_pt2272_tb.encoder_dut.bit_sent_flag decodificador_pt2272_tb.encoder_dut.clk decodificador_pt2272_tb.encoder_dut.cod_o decodificador_pt2272_tb.encoder_dut.current_state decodificador_pt2272_tb.encoder_dut.next_state decodificador_pt2272_tb.encoder_dut.osc_clk decodificador_pt2272_tb.encoder_dut.osc_clk_rose decodificador_pt2272_tb.encoder_dut.osc_rst decodificador_pt2272_tb.encoder_dut.past_osc_clk decodificador_pt2272_tb.encoder_dut.reset decodificador_pt2272_tb.encoder_dut.sync
Created probe 33
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.osc_rst decodificador_pt2272_tb.DUT.osc_clk
Created probe 34
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.A decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_ENABLER decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_LEFT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_OP_MODE decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PT2272_BIT_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_RIGHT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_SERIAL_IN decodificador_pt2272_tb.DUT.D decodificador_pt2272_tb.DUT.HIGH_PULSE_COUNTING decodificador_pt2272_tb.DUT.LOW_PULSE_COUNTING decodificador_pt2272_tb.DUT.PREVIOUS_cod_i decodificador_pt2272_tb.DUT.clk decodificador_pt2272_tb.DUT.cod_i decodificador_pt2272_tb.DUT.cod_i_FELL decodificador_pt2272_tb.DUT.cod_i_ROSE decodificador_pt2272_tb.DUT.current_state decodificador_pt2272_tb.DUT.dv decodificador_pt2272_tb.DUT.next_state decodificador_pt2272_tb.DUT.reset decodificador_pt2272_tb.DUT.reset_counters decodificador_pt2272_tb.encoder_dut.A decodificador_pt2272_tb.encoder_dut.D decodificador_pt2272_tb.encoder_dut.F_BIT_LOCATOR decodificador_pt2272_tb.encoder_dut.INTERPRETED_ADDR decodificador_pt2272_tb.encoder_dut.bit_gen_enb decodificador_pt2272_tb.encoder_dut.bit_gen_input decodificador_pt2272_tb.encoder_dut.bit_gen_output decodificador_pt2272_tb.encoder_dut.bit_gen_rst decodificador_pt2272_tb.encoder_dut.bit_generated_flag decodificador_pt2272_tb.encoder_dut.bit_sent_flag decodificador_pt2272_tb.encoder_dut.clk decodificador_pt2272_tb.encoder_dut.cod_o decodificador_pt2272_tb.encoder_dut.current_state decodificador_pt2272_tb.encoder_dut.next_state decodificador_pt2272_tb.encoder_dut.osc_clk decodificador_pt2272_tb.encoder_dut.osc_clk_rose decodificador_pt2272_tb.encoder_dut.osc_rst decodificador_pt2272_tb.encoder_dut.past_osc_clk decodificador_pt2272_tb.encoder_dut.reset decodificador_pt2272_tb.encoder_dut.sync
Created probe 35
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.osc_rst decodificador_pt2272_tb.DUT.osc_clk
Created probe 36
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.A decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_ENABLER decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_LEFT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_OP_MODE decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PT2272_BIT_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_RIGHT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_SERIAL_IN decodificador_pt2272_tb.DUT.D decodificador_pt2272_tb.DUT.HIGH_PULSE_COUNTING decodificador_pt2272_tb.DUT.LOW_PULSE_COUNTING decodificador_pt2272_tb.DUT.PREVIOUS_cod_i decodificador_pt2272_tb.DUT.clk decodificador_pt2272_tb.DUT.cod_i decodificador_pt2272_tb.DUT.cod_i_FELL decodificador_pt2272_tb.DUT.cod_i_ROSE decodificador_pt2272_tb.DUT.current_state decodificador_pt2272_tb.DUT.dv decodificador_pt2272_tb.DUT.next_state decodificador_pt2272_tb.DUT.reset decodificador_pt2272_tb.DUT.reset_counters decodificador_pt2272_tb.encoder_dut.A decodificador_pt2272_tb.encoder_dut.D decodificador_pt2272_tb.encoder_dut.F_BIT_LOCATOR decodificador_pt2272_tb.encoder_dut.INTERPRETED_ADDR decodificador_pt2272_tb.encoder_dut.bit_gen_enb decodificador_pt2272_tb.encoder_dut.bit_gen_input decodificador_pt2272_tb.encoder_dut.bit_gen_output decodificador_pt2272_tb.encoder_dut.bit_gen_rst decodificador_pt2272_tb.encoder_dut.bit_generated_flag decodificador_pt2272_tb.encoder_dut.bit_sent_flag decodificador_pt2272_tb.encoder_dut.clk decodificador_pt2272_tb.encoder_dut.cod_o decodificador_pt2272_tb.encoder_dut.current_state decodificador_pt2272_tb.encoder_dut.next_state decodificador_pt2272_tb.encoder_dut.osc_clk decodificador_pt2272_tb.encoder_dut.osc_clk_rose decodificador_pt2272_tb.encoder_dut.osc_rst decodificador_pt2272_tb.encoder_dut.past_osc_clk decodificador_pt2272_tb.encoder_dut.reset decodificador_pt2272_tb.encoder_dut.sync
Created probe 37
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.osc_rst decodificador_pt2272_tb.DUT.osc_clk
Created probe 38
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.A decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_ENABLER decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_LEFT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_OP_MODE decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PT2272_BIT_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_RIGHT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_SERIAL_IN decodificador_pt2272_tb.DUT.D decodificador_pt2272_tb.DUT.HIGH_PULSE_COUNTING decodificador_pt2272_tb.DUT.LOW_PULSE_COUNTING decodificador_pt2272_tb.DUT.PREVIOUS_cod_i decodificador_pt2272_tb.DUT.clk decodificador_pt2272_tb.DUT.cod_i decodificador_pt2272_tb.DUT.cod_i_FELL decodificador_pt2272_tb.DUT.cod_i_ROSE decodificador_pt2272_tb.DUT.current_state decodificador_pt2272_tb.DUT.dv decodificador_pt2272_tb.DUT.next_state decodificador_pt2272_tb.DUT.reset decodificador_pt2272_tb.DUT.reset_counters decodificador_pt2272_tb.encoder_dut.A decodificador_pt2272_tb.encoder_dut.D decodificador_pt2272_tb.encoder_dut.F_BIT_LOCATOR decodificador_pt2272_tb.encoder_dut.INTERPRETED_ADDR decodificador_pt2272_tb.encoder_dut.bit_gen_enb decodificador_pt2272_tb.encoder_dut.bit_gen_input decodificador_pt2272_tb.encoder_dut.bit_gen_output decodificador_pt2272_tb.encoder_dut.bit_gen_rst decodificador_pt2272_tb.encoder_dut.bit_generated_flag decodificador_pt2272_tb.encoder_dut.bit_sent_flag decodificador_pt2272_tb.encoder_dut.clk decodificador_pt2272_tb.encoder_dut.cod_o decodificador_pt2272_tb.encoder_dut.current_state decodificador_pt2272_tb.encoder_dut.next_state decodificador_pt2272_tb.encoder_dut.osc_clk decodificador_pt2272_tb.encoder_dut.osc_clk_rose decodificador_pt2272_tb.encoder_dut.osc_rst decodificador_pt2272_tb.encoder_dut.past_osc_clk decodificador_pt2272_tb.encoder_dut.reset decodificador_pt2272_tb.encoder_dut.sync
Created probe 39
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.osc_rst decodificador_pt2272_tb.DUT.osc_clk
Created probe 40
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.A decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_ENABLER decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_LEFT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_OP_MODE decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PT2272_BIT_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_RIGHT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_SERIAL_IN decodificador_pt2272_tb.DUT.D decodificador_pt2272_tb.DUT.HIGH_PULSE_COUNTING decodificador_pt2272_tb.DUT.LOW_PULSE_COUNTING decodificador_pt2272_tb.DUT.PREVIOUS_cod_i decodificador_pt2272_tb.DUT.clk decodificador_pt2272_tb.DUT.cod_i decodificador_pt2272_tb.DUT.cod_i_FELL decodificador_pt2272_tb.DUT.cod_i_ROSE decodificador_pt2272_tb.DUT.current_state decodificador_pt2272_tb.DUT.dv decodificador_pt2272_tb.DUT.next_state decodificador_pt2272_tb.DUT.reset decodificador_pt2272_tb.DUT.reset_counters decodificador_pt2272_tb.encoder_dut.A decodificador_pt2272_tb.encoder_dut.D decodificador_pt2272_tb.encoder_dut.F_BIT_LOCATOR decodificador_pt2272_tb.encoder_dut.INTERPRETED_ADDR decodificador_pt2272_tb.encoder_dut.bit_gen_enb decodificador_pt2272_tb.encoder_dut.bit_gen_input decodificador_pt2272_tb.encoder_dut.bit_gen_output decodificador_pt2272_tb.encoder_dut.bit_gen_rst decodificador_pt2272_tb.encoder_dut.bit_generated_flag decodificador_pt2272_tb.encoder_dut.bit_sent_flag decodificador_pt2272_tb.encoder_dut.clk decodificador_pt2272_tb.encoder_dut.cod_o decodificador_pt2272_tb.encoder_dut.current_state decodificador_pt2272_tb.encoder_dut.next_state decodificador_pt2272_tb.encoder_dut.osc_clk decodificador_pt2272_tb.encoder_dut.osc_clk_rose decodificador_pt2272_tb.encoder_dut.osc_rst decodificador_pt2272_tb.encoder_dut.past_osc_clk decodificador_pt2272_tb.encoder_dut.reset decodificador_pt2272_tb.encoder_dut.sync
Created probe 41
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.osc_rst decodificador_pt2272_tb.DUT.osc_clk
Created probe 42
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.A decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_ENABLER decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_LEFT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_OP_MODE decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PT2272_BIT_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_RIGHT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_SERIAL_IN decodificador_pt2272_tb.DUT.D decodificador_pt2272_tb.DUT.HIGH_PULSE_COUNTING decodificador_pt2272_tb.DUT.LOW_PULSE_COUNTING decodificador_pt2272_tb.DUT.PREVIOUS_cod_i decodificador_pt2272_tb.DUT.clk decodificador_pt2272_tb.DUT.cod_i decodificador_pt2272_tb.DUT.cod_i_FELL decodificador_pt2272_tb.DUT.cod_i_ROSE decodificador_pt2272_tb.DUT.current_state decodificador_pt2272_tb.DUT.dv decodificador_pt2272_tb.DUT.next_state decodificador_pt2272_tb.DUT.reset decodificador_pt2272_tb.DUT.reset_counters decodificador_pt2272_tb.encoder_dut.A decodificador_pt2272_tb.encoder_dut.D decodificador_pt2272_tb.encoder_dut.F_BIT_LOCATOR decodificador_pt2272_tb.encoder_dut.INTERPRETED_ADDR decodificador_pt2272_tb.encoder_dut.bit_gen_enb decodificador_pt2272_tb.encoder_dut.bit_gen_input decodificador_pt2272_tb.encoder_dut.bit_gen_output decodificador_pt2272_tb.encoder_dut.bit_gen_rst decodificador_pt2272_tb.encoder_dut.bit_generated_flag decodificador_pt2272_tb.encoder_dut.bit_sent_flag decodificador_pt2272_tb.encoder_dut.clk decodificador_pt2272_tb.encoder_dut.cod_o decodificador_pt2272_tb.encoder_dut.current_state decodificador_pt2272_tb.encoder_dut.next_state decodificador_pt2272_tb.encoder_dut.osc_clk decodificador_pt2272_tb.encoder_dut.osc_clk_rose decodificador_pt2272_tb.encoder_dut.osc_rst decodificador_pt2272_tb.encoder_dut.past_osc_clk decodificador_pt2272_tb.encoder_dut.reset decodificador_pt2272_tb.encoder_dut.sync
Created probe 43
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.osc_rst decodificador_pt2272_tb.DUT.osc_clk
Created probe 44
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.A decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_ENABLER decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_LEFT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_OP_MODE decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PT2272_BIT_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_RIGHT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_SERIAL_IN decodificador_pt2272_tb.DUT.D decodificador_pt2272_tb.DUT.HIGH_PULSE_COUNTING decodificador_pt2272_tb.DUT.LOW_PULSE_COUNTING decodificador_pt2272_tb.DUT.PREVIOUS_cod_i decodificador_pt2272_tb.DUT.clk decodificador_pt2272_tb.DUT.cod_i decodificador_pt2272_tb.DUT.cod_i_FELL decodificador_pt2272_tb.DUT.cod_i_ROSE decodificador_pt2272_tb.DUT.current_state decodificador_pt2272_tb.DUT.dv decodificador_pt2272_tb.DUT.next_state decodificador_pt2272_tb.DUT.reset decodificador_pt2272_tb.DUT.reset_counters decodificador_pt2272_tb.encoder_dut.A decodificador_pt2272_tb.encoder_dut.D decodificador_pt2272_tb.encoder_dut.F_BIT_LOCATOR decodificador_pt2272_tb.encoder_dut.INTERPRETED_ADDR decodificador_pt2272_tb.encoder_dut.bit_gen_enb decodificador_pt2272_tb.encoder_dut.bit_gen_input decodificador_pt2272_tb.encoder_dut.bit_gen_output decodificador_pt2272_tb.encoder_dut.bit_gen_rst decodificador_pt2272_tb.encoder_dut.bit_generated_flag decodificador_pt2272_tb.encoder_dut.bit_sent_flag decodificador_pt2272_tb.encoder_dut.clk decodificador_pt2272_tb.encoder_dut.cod_o decodificador_pt2272_tb.encoder_dut.current_state decodificador_pt2272_tb.encoder_dut.next_state decodificador_pt2272_tb.encoder_dut.osc_clk decodificador_pt2272_tb.encoder_dut.osc_clk_rose decodificador_pt2272_tb.encoder_dut.osc_rst decodificador_pt2272_tb.encoder_dut.past_osc_clk decodificador_pt2272_tb.encoder_dut.reset decodificador_pt2272_tb.encoder_dut.sync
Created probe 45
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.osc_rst decodificador_pt2272_tb.DUT.osc_clk
Created probe 46
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.A decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_ENABLER decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_LEFT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_OP_MODE decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PT2272_BIT_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_RIGHT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_SERIAL_IN decodificador_pt2272_tb.DUT.D decodificador_pt2272_tb.DUT.HIGH_PULSE_COUNTING decodificador_pt2272_tb.DUT.LOW_PULSE_COUNTING decodificador_pt2272_tb.DUT.PREVIOUS_cod_i decodificador_pt2272_tb.DUT.clk decodificador_pt2272_tb.DUT.cod_i decodificador_pt2272_tb.DUT.cod_i_FELL decodificador_pt2272_tb.DUT.cod_i_ROSE decodificador_pt2272_tb.DUT.current_state decodificador_pt2272_tb.DUT.dv decodificador_pt2272_tb.DUT.next_state decodificador_pt2272_tb.DUT.reset decodificador_pt2272_tb.DUT.reset_counters decodificador_pt2272_tb.encoder_dut.A decodificador_pt2272_tb.encoder_dut.D decodificador_pt2272_tb.encoder_dut.F_BIT_LOCATOR decodificador_pt2272_tb.encoder_dut.INTERPRETED_ADDR decodificador_pt2272_tb.encoder_dut.bit_gen_enb decodificador_pt2272_tb.encoder_dut.bit_gen_input decodificador_pt2272_tb.encoder_dut.bit_gen_output decodificador_pt2272_tb.encoder_dut.bit_gen_rst decodificador_pt2272_tb.encoder_dut.bit_generated_flag decodificador_pt2272_tb.encoder_dut.bit_sent_flag decodificador_pt2272_tb.encoder_dut.clk decodificador_pt2272_tb.encoder_dut.cod_o decodificador_pt2272_tb.encoder_dut.current_state decodificador_pt2272_tb.encoder_dut.next_state decodificador_pt2272_tb.encoder_dut.osc_clk decodificador_pt2272_tb.encoder_dut.osc_clk_rose decodificador_pt2272_tb.encoder_dut.osc_rst decodificador_pt2272_tb.encoder_dut.past_osc_clk decodificador_pt2272_tb.encoder_dut.reset decodificador_pt2272_tb.encoder_dut.sync
Created probe 47
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.osc_rst decodificador_pt2272_tb.DUT.osc_clk
Created probe 48
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.A decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_ENABLER decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_LEFT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_OP_MODE decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PT2272_BIT_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_RIGHT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_SERIAL_IN decodificador_pt2272_tb.DUT.D decodificador_pt2272_tb.DUT.HIGH_PULSE_COUNTING decodificador_pt2272_tb.DUT.LOW_PULSE_COUNTING decodificador_pt2272_tb.DUT.PREVIOUS_cod_i decodificador_pt2272_tb.DUT.clk decodificador_pt2272_tb.DUT.cod_i decodificador_pt2272_tb.DUT.cod_i_FELL decodificador_pt2272_tb.DUT.cod_i_ROSE decodificador_pt2272_tb.DUT.current_state decodificador_pt2272_tb.DUT.dv decodificador_pt2272_tb.DUT.next_state decodificador_pt2272_tb.DUT.reset decodificador_pt2272_tb.DUT.reset_counters decodificador_pt2272_tb.encoder_dut.A decodificador_pt2272_tb.encoder_dut.D decodificador_pt2272_tb.encoder_dut.F_BIT_LOCATOR decodificador_pt2272_tb.encoder_dut.INTERPRETED_ADDR decodificador_pt2272_tb.encoder_dut.bit_gen_enb decodificador_pt2272_tb.encoder_dut.bit_gen_input decodificador_pt2272_tb.encoder_dut.bit_gen_output decodificador_pt2272_tb.encoder_dut.bit_gen_rst decodificador_pt2272_tb.encoder_dut.bit_generated_flag decodificador_pt2272_tb.encoder_dut.bit_sent_flag decodificador_pt2272_tb.encoder_dut.clk decodificador_pt2272_tb.encoder_dut.cod_o decodificador_pt2272_tb.encoder_dut.current_state decodificador_pt2272_tb.encoder_dut.next_state decodificador_pt2272_tb.encoder_dut.osc_clk decodificador_pt2272_tb.encoder_dut.osc_clk_rose decodificador_pt2272_tb.encoder_dut.osc_rst decodificador_pt2272_tb.encoder_dut.past_osc_clk decodificador_pt2272_tb.encoder_dut.reset decodificador_pt2272_tb.encoder_dut.sync
Created probe 49
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.osc_rst decodificador_pt2272_tb.DUT.osc_clk
Created probe 50
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.A decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_ENABLER decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_LEFT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_OP_MODE decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PT2272_BIT_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_RIGHT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_SERIAL_IN decodificador_pt2272_tb.DUT.D decodificador_pt2272_tb.DUT.HIGH_PULSE_COUNTING decodificador_pt2272_tb.DUT.LOW_PULSE_COUNTING decodificador_pt2272_tb.DUT.PREVIOUS_cod_i decodificador_pt2272_tb.DUT.clk decodificador_pt2272_tb.DUT.cod_i decodificador_pt2272_tb.DUT.cod_i_FELL decodificador_pt2272_tb.DUT.cod_i_ROSE decodificador_pt2272_tb.DUT.current_state decodificador_pt2272_tb.DUT.dv decodificador_pt2272_tb.DUT.next_state decodificador_pt2272_tb.DUT.reset decodificador_pt2272_tb.DUT.reset_counters decodificador_pt2272_tb.encoder_dut.A decodificador_pt2272_tb.encoder_dut.D decodificador_pt2272_tb.encoder_dut.F_BIT_LOCATOR decodificador_pt2272_tb.encoder_dut.INTERPRETED_ADDR decodificador_pt2272_tb.encoder_dut.bit_gen_enb decodificador_pt2272_tb.encoder_dut.bit_gen_input decodificador_pt2272_tb.encoder_dut.bit_gen_output decodificador_pt2272_tb.encoder_dut.bit_gen_rst decodificador_pt2272_tb.encoder_dut.bit_generated_flag decodificador_pt2272_tb.encoder_dut.bit_sent_flag decodificador_pt2272_tb.encoder_dut.clk decodificador_pt2272_tb.encoder_dut.cod_o decodificador_pt2272_tb.encoder_dut.current_state decodificador_pt2272_tb.encoder_dut.next_state decodificador_pt2272_tb.encoder_dut.osc_clk decodificador_pt2272_tb.encoder_dut.osc_clk_rose decodificador_pt2272_tb.encoder_dut.osc_rst decodificador_pt2272_tb.encoder_dut.past_osc_clk decodificador_pt2272_tb.encoder_dut.reset decodificador_pt2272_tb.encoder_dut.sync
Created probe 51
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.osc_rst decodificador_pt2272_tb.DUT.osc_clk
Created probe 52
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.A decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_ENABLER decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_LEFT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_OP_MODE decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PT2272_BIT_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_RIGHT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_SERIAL_IN decodificador_pt2272_tb.DUT.D decodificador_pt2272_tb.DUT.HIGH_PULSE_COUNTING decodificador_pt2272_tb.DUT.LOW_PULSE_COUNTING decodificador_pt2272_tb.DUT.PREVIOUS_cod_i decodificador_pt2272_tb.DUT.clk decodificador_pt2272_tb.DUT.cod_i decodificador_pt2272_tb.DUT.cod_i_FELL decodificador_pt2272_tb.DUT.cod_i_ROSE decodificador_pt2272_tb.DUT.current_state decodificador_pt2272_tb.DUT.dv decodificador_pt2272_tb.DUT.next_state decodificador_pt2272_tb.DUT.reset decodificador_pt2272_tb.DUT.reset_counters decodificador_pt2272_tb.encoder_dut.A decodificador_pt2272_tb.encoder_dut.D decodificador_pt2272_tb.encoder_dut.F_BIT_LOCATOR decodificador_pt2272_tb.encoder_dut.INTERPRETED_ADDR decodificador_pt2272_tb.encoder_dut.bit_gen_enb decodificador_pt2272_tb.encoder_dut.bit_gen_input decodificador_pt2272_tb.encoder_dut.bit_gen_output decodificador_pt2272_tb.encoder_dut.bit_gen_rst decodificador_pt2272_tb.encoder_dut.bit_generated_flag decodificador_pt2272_tb.encoder_dut.bit_sent_flag decodificador_pt2272_tb.encoder_dut.clk decodificador_pt2272_tb.encoder_dut.cod_o decodificador_pt2272_tb.encoder_dut.current_state decodificador_pt2272_tb.encoder_dut.next_state decodificador_pt2272_tb.encoder_dut.osc_clk decodificador_pt2272_tb.encoder_dut.osc_clk_rose decodificador_pt2272_tb.encoder_dut.osc_rst decodificador_pt2272_tb.encoder_dut.past_osc_clk decodificador_pt2272_tb.encoder_dut.reset decodificador_pt2272_tb.encoder_dut.sync
Created probe 53
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.osc_rst decodificador_pt2272_tb.DUT.osc_clk
Created probe 54
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.A decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_ENABLER decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_LEFT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_OP_MODE decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PT2272_BIT_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_RIGHT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_SERIAL_IN decodificador_pt2272_tb.DUT.D decodificador_pt2272_tb.DUT.HIGH_PULSE_COUNTING decodificador_pt2272_tb.DUT.LOW_PULSE_COUNTING decodificador_pt2272_tb.DUT.PREVIOUS_cod_i decodificador_pt2272_tb.DUT.clk decodificador_pt2272_tb.DUT.cod_i decodificador_pt2272_tb.DUT.cod_i_FELL decodificador_pt2272_tb.DUT.cod_i_ROSE decodificador_pt2272_tb.DUT.current_state decodificador_pt2272_tb.DUT.dv decodificador_pt2272_tb.DUT.next_state decodificador_pt2272_tb.DUT.reset decodificador_pt2272_tb.DUT.reset_counters decodificador_pt2272_tb.encoder_dut.A decodificador_pt2272_tb.encoder_dut.D decodificador_pt2272_tb.encoder_dut.F_BIT_LOCATOR decodificador_pt2272_tb.encoder_dut.INTERPRETED_ADDR decodificador_pt2272_tb.encoder_dut.bit_gen_enb decodificador_pt2272_tb.encoder_dut.bit_gen_input decodificador_pt2272_tb.encoder_dut.bit_gen_output decodificador_pt2272_tb.encoder_dut.bit_gen_rst decodificador_pt2272_tb.encoder_dut.bit_generated_flag decodificador_pt2272_tb.encoder_dut.bit_sent_flag decodificador_pt2272_tb.encoder_dut.clk decodificador_pt2272_tb.encoder_dut.cod_o decodificador_pt2272_tb.encoder_dut.current_state decodificador_pt2272_tb.encoder_dut.next_state decodificador_pt2272_tb.encoder_dut.osc_clk decodificador_pt2272_tb.encoder_dut.osc_clk_rose decodificador_pt2272_tb.encoder_dut.osc_rst decodificador_pt2272_tb.encoder_dut.past_osc_clk decodificador_pt2272_tb.encoder_dut.reset decodificador_pt2272_tb.encoder_dut.sync
Created probe 55
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.osc_rst decodificador_pt2272_tb.DUT.osc_clk
Created probe 56
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.A decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_ENABLER decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_LEFT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_OP_MODE decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PT2272_BIT_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_RIGHT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_SERIAL_IN decodificador_pt2272_tb.DUT.D decodificador_pt2272_tb.DUT.HIGH_PULSE_COUNTING decodificador_pt2272_tb.DUT.LOW_PULSE_COUNTING decodificador_pt2272_tb.DUT.PREVIOUS_cod_i decodificador_pt2272_tb.DUT.clk decodificador_pt2272_tb.DUT.cod_i decodificador_pt2272_tb.DUT.cod_i_FELL decodificador_pt2272_tb.DUT.cod_i_ROSE decodificador_pt2272_tb.DUT.current_state decodificador_pt2272_tb.DUT.dv decodificador_pt2272_tb.DUT.next_state decodificador_pt2272_tb.DUT.reset decodificador_pt2272_tb.DUT.reset_counters decodificador_pt2272_tb.encoder_dut.A decodificador_pt2272_tb.encoder_dut.D decodificador_pt2272_tb.encoder_dut.F_BIT_LOCATOR decodificador_pt2272_tb.encoder_dut.INTERPRETED_ADDR decodificador_pt2272_tb.encoder_dut.bit_gen_enb decodificador_pt2272_tb.encoder_dut.bit_gen_input decodificador_pt2272_tb.encoder_dut.bit_gen_output decodificador_pt2272_tb.encoder_dut.bit_gen_rst decodificador_pt2272_tb.encoder_dut.bit_generated_flag decodificador_pt2272_tb.encoder_dut.bit_sent_flag decodificador_pt2272_tb.encoder_dut.clk decodificador_pt2272_tb.encoder_dut.cod_o decodificador_pt2272_tb.encoder_dut.current_state decodificador_pt2272_tb.encoder_dut.next_state decodificador_pt2272_tb.encoder_dut.osc_clk decodificador_pt2272_tb.encoder_dut.osc_clk_rose decodificador_pt2272_tb.encoder_dut.osc_rst decodificador_pt2272_tb.encoder_dut.past_osc_clk decodificador_pt2272_tb.encoder_dut.reset decodificador_pt2272_tb.encoder_dut.sync
Created probe 57
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.osc_rst decodificador_pt2272_tb.DUT.osc_clk
Created probe 58
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.A decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_ENABLER decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_LEFT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_OP_MODE decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PT2272_BIT_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_RIGHT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_SERIAL_IN decodificador_pt2272_tb.DUT.D decodificador_pt2272_tb.DUT.HIGH_PULSE_COUNTING decodificador_pt2272_tb.DUT.LOW_PULSE_COUNTING decodificador_pt2272_tb.DUT.PREVIOUS_cod_i decodificador_pt2272_tb.DUT.clk decodificador_pt2272_tb.DUT.cod_i decodificador_pt2272_tb.DUT.cod_i_FELL decodificador_pt2272_tb.DUT.cod_i_ROSE decodificador_pt2272_tb.DUT.current_state decodificador_pt2272_tb.DUT.dv decodificador_pt2272_tb.DUT.next_state decodificador_pt2272_tb.DUT.reset decodificador_pt2272_tb.DUT.reset_counters decodificador_pt2272_tb.encoder_dut.A decodificador_pt2272_tb.encoder_dut.D decodificador_pt2272_tb.encoder_dut.F_BIT_LOCATOR decodificador_pt2272_tb.encoder_dut.INTERPRETED_ADDR decodificador_pt2272_tb.encoder_dut.bit_gen_enb decodificador_pt2272_tb.encoder_dut.bit_gen_input decodificador_pt2272_tb.encoder_dut.bit_gen_output decodificador_pt2272_tb.encoder_dut.bit_gen_rst decodificador_pt2272_tb.encoder_dut.bit_generated_flag decodificador_pt2272_tb.encoder_dut.bit_sent_flag decodificador_pt2272_tb.encoder_dut.clk decodificador_pt2272_tb.encoder_dut.cod_o decodificador_pt2272_tb.encoder_dut.current_state decodificador_pt2272_tb.encoder_dut.next_state decodificador_pt2272_tb.encoder_dut.osc_clk decodificador_pt2272_tb.encoder_dut.osc_clk_rose decodificador_pt2272_tb.encoder_dut.osc_rst decodificador_pt2272_tb.encoder_dut.past_osc_clk decodificador_pt2272_tb.encoder_dut.reset decodificador_pt2272_tb.encoder_dut.sync
Created probe 59
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.osc_rst decodificador_pt2272_tb.DUT.osc_clk
Created probe 60
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.A decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_ENABLER decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_LEFT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_OP_MODE decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PT2272_BIT_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_RIGHT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_SERIAL_IN decodificador_pt2272_tb.DUT.D decodificador_pt2272_tb.DUT.HIGH_PULSE_COUNTING decodificador_pt2272_tb.DUT.LOW_PULSE_COUNTING decodificador_pt2272_tb.DUT.PREVIOUS_cod_i decodificador_pt2272_tb.DUT.clk decodificador_pt2272_tb.DUT.cod_i decodificador_pt2272_tb.DUT.cod_i_FELL decodificador_pt2272_tb.DUT.cod_i_ROSE decodificador_pt2272_tb.DUT.current_state decodificador_pt2272_tb.DUT.dv decodificador_pt2272_tb.DUT.next_state decodificador_pt2272_tb.DUT.reset decodificador_pt2272_tb.DUT.reset_counters decodificador_pt2272_tb.encoder_dut.A decodificador_pt2272_tb.encoder_dut.D decodificador_pt2272_tb.encoder_dut.F_BIT_LOCATOR decodificador_pt2272_tb.encoder_dut.INTERPRETED_ADDR decodificador_pt2272_tb.encoder_dut.bit_gen_enb decodificador_pt2272_tb.encoder_dut.bit_gen_input decodificador_pt2272_tb.encoder_dut.bit_gen_output decodificador_pt2272_tb.encoder_dut.bit_gen_rst decodificador_pt2272_tb.encoder_dut.bit_generated_flag decodificador_pt2272_tb.encoder_dut.bit_sent_flag decodificador_pt2272_tb.encoder_dut.clk decodificador_pt2272_tb.encoder_dut.cod_o decodificador_pt2272_tb.encoder_dut.current_state decodificador_pt2272_tb.encoder_dut.next_state decodificador_pt2272_tb.encoder_dut.osc_clk decodificador_pt2272_tb.encoder_dut.osc_clk_rose decodificador_pt2272_tb.encoder_dut.osc_rst decodificador_pt2272_tb.encoder_dut.past_osc_clk decodificador_pt2272_tb.encoder_dut.reset decodificador_pt2272_tb.encoder_dut.sync
Created probe 61
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.osc_rst decodificador_pt2272_tb.DUT.osc_clk
Created probe 62
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.A decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_ENABLER decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_LEFT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_OP_MODE decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PT2272_BIT_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_RIGHT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_SERIAL_IN decodificador_pt2272_tb.DUT.D decodificador_pt2272_tb.DUT.HIGH_PULSE_COUNTING decodificador_pt2272_tb.DUT.LOW_PULSE_COUNTING decodificador_pt2272_tb.DUT.PREVIOUS_cod_i decodificador_pt2272_tb.DUT.clk decodificador_pt2272_tb.DUT.cod_i decodificador_pt2272_tb.DUT.cod_i_FELL decodificador_pt2272_tb.DUT.cod_i_ROSE decodificador_pt2272_tb.DUT.current_state decodificador_pt2272_tb.DUT.dv decodificador_pt2272_tb.DUT.next_state decodificador_pt2272_tb.DUT.reset decodificador_pt2272_tb.DUT.reset_counters decodificador_pt2272_tb.encoder_dut.A decodificador_pt2272_tb.encoder_dut.D decodificador_pt2272_tb.encoder_dut.F_BIT_LOCATOR decodificador_pt2272_tb.encoder_dut.INTERPRETED_ADDR decodificador_pt2272_tb.encoder_dut.bit_gen_enb decodificador_pt2272_tb.encoder_dut.bit_gen_input decodificador_pt2272_tb.encoder_dut.bit_gen_output decodificador_pt2272_tb.encoder_dut.bit_gen_rst decodificador_pt2272_tb.encoder_dut.bit_generated_flag decodificador_pt2272_tb.encoder_dut.bit_sent_flag decodificador_pt2272_tb.encoder_dut.clk decodificador_pt2272_tb.encoder_dut.cod_o decodificador_pt2272_tb.encoder_dut.current_state decodificador_pt2272_tb.encoder_dut.next_state decodificador_pt2272_tb.encoder_dut.osc_clk decodificador_pt2272_tb.encoder_dut.osc_clk_rose decodificador_pt2272_tb.encoder_dut.osc_rst decodificador_pt2272_tb.encoder_dut.past_osc_clk decodificador_pt2272_tb.encoder_dut.reset decodificador_pt2272_tb.encoder_dut.sync
Created probe 63
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.osc_rst decodificador_pt2272_tb.DUT.osc_clk
Created probe 64
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.A decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_ENABLER decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_LEFT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_OP_MODE decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PT2272_BIT_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_RIGHT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_SERIAL_IN decodificador_pt2272_tb.DUT.D decodificador_pt2272_tb.DUT.HIGH_PULSE_COUNTING decodificador_pt2272_tb.DUT.LOW_PULSE_COUNTING decodificador_pt2272_tb.DUT.PREVIOUS_cod_i decodificador_pt2272_tb.DUT.clk decodificador_pt2272_tb.DUT.cod_i decodificador_pt2272_tb.DUT.cod_i_FELL decodificador_pt2272_tb.DUT.cod_i_ROSE decodificador_pt2272_tb.DUT.current_state decodificador_pt2272_tb.DUT.dv decodificador_pt2272_tb.DUT.next_state decodificador_pt2272_tb.DUT.reset decodificador_pt2272_tb.DUT.reset_counters decodificador_pt2272_tb.encoder_dut.A decodificador_pt2272_tb.encoder_dut.D decodificador_pt2272_tb.encoder_dut.F_BIT_LOCATOR decodificador_pt2272_tb.encoder_dut.INTERPRETED_ADDR decodificador_pt2272_tb.encoder_dut.bit_gen_enb decodificador_pt2272_tb.encoder_dut.bit_gen_input decodificador_pt2272_tb.encoder_dut.bit_gen_output decodificador_pt2272_tb.encoder_dut.bit_gen_rst decodificador_pt2272_tb.encoder_dut.bit_generated_flag decodificador_pt2272_tb.encoder_dut.bit_sent_flag decodificador_pt2272_tb.encoder_dut.clk decodificador_pt2272_tb.encoder_dut.cod_o decodificador_pt2272_tb.encoder_dut.current_state decodificador_pt2272_tb.encoder_dut.next_state decodificador_pt2272_tb.encoder_dut.osc_clk decodificador_pt2272_tb.encoder_dut.osc_clk_rose decodificador_pt2272_tb.encoder_dut.osc_rst decodificador_pt2272_tb.encoder_dut.past_osc_clk decodificador_pt2272_tb.encoder_dut.reset decodificador_pt2272_tb.encoder_dut.sync
Created probe 65
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.osc_rst decodificador_pt2272_tb.DUT.osc_clk
Created probe 66
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.osc_rst decodificador_pt2272_tb.DUT.clk decodificador_pt2272_tb.DUT.A decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_ENABLER decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_LEFT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_OP_MODE decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PT2272_BIT_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_RIGHT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_SERIAL_IN decodificador_pt2272_tb.DUT.D decodificador_pt2272_tb.DUT.HIGH_PULSE_COUNTING decodificador_pt2272_tb.DUT.LOW_PULSE_COUNTING decodificador_pt2272_tb.DUT.PREVIOUS_cod_i decodificador_pt2272_tb.DUT.osc_clk decodificador_pt2272_tb.DUT.cod_i decodificador_pt2272_tb.DUT.cod_i_FELL decodificador_pt2272_tb.DUT.cod_i_ROSE decodificador_pt2272_tb.DUT.current_state decodificador_pt2272_tb.DUT.dv decodificador_pt2272_tb.DUT.next_state decodificador_pt2272_tb.DUT.reset decodificador_pt2272_tb.DUT.reset_counters decodificador_pt2272_tb.encoder_dut.A decodificador_pt2272_tb.encoder_dut.D decodificador_pt2272_tb.encoder_dut.F_BIT_LOCATOR decodificador_pt2272_tb.encoder_dut.INTERPRETED_ADDR decodificador_pt2272_tb.encoder_dut.bit_gen_enb decodificador_pt2272_tb.encoder_dut.bit_gen_input decodificador_pt2272_tb.encoder_dut.bit_gen_output decodificador_pt2272_tb.encoder_dut.bit_gen_rst decodificador_pt2272_tb.encoder_dut.bit_generated_flag decodificador_pt2272_tb.encoder_dut.bit_sent_flag decodificador_pt2272_tb.encoder_dut.clk decodificador_pt2272_tb.encoder_dut.cod_o decodificador_pt2272_tb.encoder_dut.current_state decodificador_pt2272_tb.encoder_dut.next_state decodificador_pt2272_tb.encoder_dut.osc_clk decodificador_pt2272_tb.encoder_dut.osc_clk_rose decodificador_pt2272_tb.encoder_dut.osc_rst decodificador_pt2272_tb.encoder_dut.past_osc_clk decodificador_pt2272_tb.encoder_dut.reset decodificador_pt2272_tb.encoder_dut.sync
Created probe 67
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.internal_a decodificador_pt2272_tb.DUT.internal_f_bit_locator decodificador_pt2272_tb.DUT.internal_interpreted_addr
Created probe 68
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.INTERPRETED_ADDR decodificador_pt2272_tb.DUT.F_BIT_LOCATOR
Created probe 69
xcelium> probe -create -database waves decodificador_pt2272_tb.DUT.osc_rst decodificador_pt2272_tb.DUT.clk decodificador_pt2272_tb.DUT.A decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_ENABLER decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_LEFT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_OP_MODE decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PARALLEL_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_PT2272_BIT_IN decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_RIGHT_SHIFT_OUT decodificador_pt2272_tb.DUT.BIDIR_SHIFTREG_SERIAL_IN decodificador_pt2272_tb.DUT.D decodificador_pt2272_tb.DUT.HIGH_PULSE_COUNTING decodificador_pt2272_tb.DUT.LOW_PULSE_COUNTING decodificador_pt2272_tb.DUT.PREVIOUS_cod_i decodificador_pt2272_tb.DUT.osc_clk decodificador_pt2272_tb.DUT.cod_i decodificador_pt2272_tb.DUT.cod_i_FELL decodificador_pt2272_tb.DUT.cod_i_ROSE decodificador_pt2272_tb.DUT.current_state decodificador_pt2272_tb.DUT.dv decodificador_pt2272_tb.DUT.next_state decodificador_pt2272_tb.DUT.reset decodificador_pt2272_tb.DUT.reset_counters decodificador_pt2272_tb.DUT.internal_a decodificador_pt2272_tb.DUT.internal_f_bit_locator decodificador_pt2272_tb.DUT.internal_interpreted_addr decodificador_pt2272_tb.DUT.INTERPRETED_ADDR decodificador_pt2272_tb.DUT.F_BIT_LOCATOR decodificador_pt2272_tb.encoder_dut.A decodificador_pt2272_tb.encoder_dut.D decodificador_pt2272_tb.encoder_dut.F_BIT_LOCATOR decodificador_pt2272_tb.encoder_dut.INTERPRETED_ADDR decodificador_pt2272_tb.encoder_dut.bit_gen_enb decodificador_pt2272_tb.encoder_dut.bit_gen_input decodificador_pt2272_tb.encoder_dut.bit_gen_output decodificador_pt2272_tb.encoder_dut.bit_gen_rst decodificador_pt2272_tb.encoder_dut.bit_generated_flag decodificador_pt2272_tb.encoder_dut.bit_sent_flag decodificador_pt2272_tb.encoder_dut.clk decodificador_pt2272_tb.encoder_dut.cod_o decodificador_pt2272_tb.encoder_dut.current_state decodificador_pt2272_tb.encoder_dut.next_state decodificador_pt2272_tb.encoder_dut.osc_clk decodificador_pt2272_tb.encoder_dut.osc_clk_rose decodificador_pt2272_tb.encoder_dut.osc_rst decodificador_pt2272_tb.encoder_dut.past_osc_clk decodificador_pt2272_tb.encoder_dut.reset decodificador_pt2272_tb.encoder_dut.sync
Created probe 70
xcelium> 
xcelium> simvision -input restore_dec.tcl.svcf
xcelium> input -quiet .reinvoke.sim
xcelium> file delete .reinvoke.sim
xcelium> run
Simulation complete via $finish(1) at time 91039575 NS + 3
./decoder/decodificador_pt2272_tb.sv:210         $finish;
xcelium> 