
# read_lib library/slow.lib

# read_hdl source/fulladder.v

# elaborate fulladder

# check_design -unresolved

# syn_gen

# syn_map

# syn_opt

# report area > fulladder_area.txt

# report power > fulladder_power.txt

# report gates > fulladder_gates.txt

# write_hdl > fulladder_netlist.v